var {db, ObjectId} = require("./mongoCompat");
const coll = db.getCollection("rule");
export default coll;

/** rule indexes **/
db.getCollection("rule").ensureIndex({
  "_id": 1
},[
  
]);

/** rule indexes **/
db.getCollection("rule").ensureIndex({
  "noRoom": 1
},[
  
]);

/** rule records **/
db.getCollection("rule").insert({
  "_id": 16,
  "abstract": "鳥の駒を使った将棋。",
  "init": {
    "ban": [
      [
        [
          1,
          "ay"
        ],
        [
          
        ],
        [
          1,
          "bb"
        ],
        [
          
        ],
        [
          0,
          "bb"
        ],
        [
          
        ],
        [
          0,
          "az"
        ]
      ],
      [
        [
          1,
          "ax"
        ],
        [
          
        ],
        [
          1,
          "bb"
        ],
        [
          
        ],
        [
          0,
          "bb"
        ],
        [
          
        ],
        [
          0,
          "ax"
        ]
      ],
      [
        [
          1,
          "aw"
        ],
        [
          
        ],
        [
          1,
          "bb"
        ],
        [
          0,
          "bb"
        ],
        [
          0,
          "bb"
        ],
        [
          
        ],
        [
          0,
          "aw"
        ]
      ],
      [
        [
          1,
          "av"
        ],
        [
          1,
          "ba"
        ],
        [
          1,
          "bb"
        ],
        [
          
        ],
        [
          0,
          "bb"
        ],
        [
          0,
          "ba"
        ],
        [
          0,
          "av"
        ]
      ],
      [
        [
          1,
          "aw"
        ],
        [
          
        ],
        [
          1,
          "bb"
        ],
        [
          1,
          "bb"
        ],
        [
          0,
          "bb"
        ],
        [
          
        ],
        [
          0,
          "aw"
        ]
      ],
      [
        [
          1,
          "ax"
        ],
        [
          
        ],
        [
          1,
          "bb"
        ],
        [
          
        ],
        [
          0,
          "bb"
        ],
        [
          
        ],
        [
          0,
          "ax"
        ]
      ],
      [
        [
          1,
          "az"
        ],
        [
          
        ],
        [
          1,
          "bb"
        ],
        [
          
        ],
        [
          0,
          "bb"
        ],
        [
          
        ],
        [
          0,
          "ay"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "av",
    "aw",
    "ax",
    "ay",
    "az",
    "ba",
    "bb",
    "bc",
    "bd"
  ],
  "name": "禽将棋",
  "nari": {
    "av": null,
    "aw": null,
    "ax": null,
    "ay": null,
    "az": null,
    "ba": "bc",
    "bb": "bd"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000015")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000016")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000017")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000018")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000019")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00001a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00001b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00001c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00001d")
    }
  ],
  "size": [
    7,
    7
  ],
  "strategy": {
    "Promotion": {
      "Normal": {
        "dan": 2,
        "must": true
      }
    }
  },
  "winkoma": [
    "av"
  ]
});
db.getCollection("rule").insert({
  "_id": 39,
  "abstract": "縦横で挟んだらとれる。複数も可。端で敵駒を動けないように囲んでもとれる。相手の駒を４枚以下にしたら勝ち。",
  "init": {
    "ban": [
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "cd",
    "ce"
  ],
  "name": "はさみ将棋",
  "nari": {
    "cd": null,
    "ce": null
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000037")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000038")
    }
  ],
  "size": [
    9,
    9
  ],
  "strategy": {
    "Judge": {
      "Count": {
        "lte": 4
      }
    },
    "MoveEffect": {
      "Hasami": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 47,
  "extend": {
    "$ref": "rule",
    "$id": 46
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ch"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ch"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "小京将棋(右京配置)",
  "strategy": null
});
db.getCollection("rule").insert({
  "_id": 56,
  "abstract": "安南将棋を、常に駒の本来の動きもできるようにしたもの。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "天竺将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "KomaSuggest": {
      "Tenjiku": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 58,
  "abstract": "歩はポーン、桂はナイトの働きをする。ポーンは１段目でクイーンに成る。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "fr"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "fr"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "be"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "fr"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "fr"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "be"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "fr"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "fr"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "fr"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "fr"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "fr"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "fr"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "fr"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "fr"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "fr"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "fr"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "be"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "fr"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "fr"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "be"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "fr"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "fr"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "歩ポーン桂ナイト将棋",
  "nari": {
    "fr": "ft",
    "ab": "aj",
    "be": null,
    "ad": "al",
    "ae": null,
    "af": "am",
    "ag": "an",
    "ah": null
  },
  "noRoom": true,
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      }
    },
    "Promotion": {
      "Normal": {
        "species": {
          "fr": 1
        }
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 70,
  "abstract": "味方の駒が縦に複数並んだとき、上からn番目の駒の性能が下からn番目の駒の性能になる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "ネコ鮮将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "KomaSuggest": {
      "Nekosen": true
    },
    "Promotion": {
      "Normal": {
        "illegal": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 78,
  "abstract": "駒を動かした時、その駒の利きにある敵の駒を裏返す。相手を二歩にしても勝ち。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "核分裂",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MoveEffect": {
      "Nuclear": true
    },
    "Nifu": {
      "Penalty": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 84,
  "abstract": "チェッカー。",
  "img": {
    "height": 48,
    "width": 48
  },
  "init": {
    "ban": [
      [
        [
          1,
          "yp"
        ],
        [
          
        ],
        [
          1,
          "yp"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yp"
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          1,
          "yp"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yp"
        ],
        [
          
        ],
        [
          0,
          "yp"
        ]
      ],
      [
        [
          1,
          "yp"
        ],
        [
          
        ],
        [
          1,
          "yp"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yp"
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          1,
          "yp"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yp"
        ],
        [
          
        ],
        [
          0,
          "yp"
        ]
      ],
      [
        [
          1,
          "yp"
        ],
        [
          
        ],
        [
          1,
          "yp"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yp"
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          1,
          "yp"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yp"
        ],
        [
          
        ],
        [
          0,
          "yp"
        ]
      ],
      [
        [
          1,
          "yp"
        ],
        [
          
        ],
        [
          1,
          "yp"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yp"
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          1,
          "yp"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yp"
        ],
        [
          
        ],
        [
          0,
          "yp"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "yp",
    "yq"
  ],
  "name": "チェッカー",
  "nari": {
    "yp": "yq"
  },
  "noreverse": "koma",
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000195")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000196")
    }
  ],
  "size": [
    8,
    8
  ],
  "strategy": {
    "Judge": {
      "NoMove": true
    },
    "MochigomaIO": {
      "NoUse": true
    },
    "MoveControl": {
      "Same": true
    },
    "MoveEffect": {
      "Checker": true
    },
    "Promotion": {
      "Normal": {
        "dan": 1,
        "must": true
      }
    },
    "TebanRotation": {
      "Checker": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 85,
  incomplete: true,
  "abstract": "囲碁。ただし「両者連続パスして終了した時点で、石をなるべくたくさん盤上に置いたほうの勝ち」(終局未実装)",
  "css": "igo",
  "img": {
    "height": 30,
    "width": 30
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "yo"
  ],
  "name": "純碁",
  "nari": [
    
  ],
  "noreverse": "koma",
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000194")
    }
  ],
  "size": [
    19,
    19
  ],
  "strategy": {
    "Judge": {
      "Igo": true
    },
    "MochigomaIO": {
      "Infinity": {
        "autoput": true
      }
    },
    "MoveControl": {
      "Igo": true
    },
    "MoveEffect": {
      "Igo": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 103,
  "abstract": "玉以外角。持ち駒と成りはなし。",
  "init": {
    "ban": [
      [
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "af"
        ],
        [
          
        ],
        [
          0,
          "af"
        ]
      ],
      [
        [
          1,
          "af"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "af"
        ]
      ],
      [
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "af"
        ],
        [
          
        ],
        [
          0,
          "af"
        ]
      ],
      [
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "af"
        ],
        [
          
        ],
        [
          0,
          "af"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "af"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "af"
        ],
        [
          
        ],
        [
          0,
          "af"
        ]
      ],
      [
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "af"
        ],
        [
          
        ],
        [
          0,
          "af"
        ]
      ],
      [
        [
          1,
          "af"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "af"
        ]
      ],
      [
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "af"
        ],
        [
          
        ],
        [
          0,
          "af"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "af",
    "ah"
  ],
  "name": "角将棋",
  "nari": [
    
  ],
  "override": 0,
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    }
  ],
  "size": [
    9,
    9
  ],
  "strategy": {
    "MochigomaIO": {
      "NoUse": true
    }
  },
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 2,
  "abstract": "普通の将棋から、上手側の角を落としたもの。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ]
  },
  "komaochi": true,
  "name": "本将棋(角落ち)",
  "players": [
    1,
    0
  ],
  "strategy": null
});
db.getCollection("rule").insert({
  "_id": 3,
  "abstract": "普通の将棋から、上手側の飛車を落としたもの。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ]
  },
  "komaochi": true,
  "name": "本将棋(飛車落ち)",
  "players": [
    1,
    0
  ],
  "strategy": null
});
db.getCollection("rule").insert({
  "_id": 5,
  "abstract": "普通の将棋から、上手側の飛車と角（＝二枚）を落としたもの。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ]
  },
  "komaochi": true,
  "name": "本将棋(二枚落ち)",
  "players": [
    1,
    0
  ],
  "strategy": null
});
db.getCollection("rule").insert({
  "_id": 6,
  "abstract": "普通の将棋から、上手側の飛車・角を１枚ずつ、香車を１枚（＝四枚）を落としたもの。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ]
  },
  "komaochi": true,
  "name": "本将棋(四枚落ち)",
  "players": [
    1,
    0
  ],
  "strategy": null
});
db.getCollection("rule").insert({
  "_id": 9,
  "abstract": "普通の将棋から、上手側の飛車・角を１枚ずつ、香・桂・銀・金を２枚ずつ（＝十枚）を落としたもの。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ]
  },
  "komaochi": true,
  "name": "本将棋(十枚落ち)",
  "players": [
    1,
    0
  ],
  "strategy": null
});
db.getCollection("rule").insert({
  "_id": 17,
  "abstract": "北尾まどか女流プロが考案した、初心者向けの将棋。",
  "img": {
    "height": 70,
    "width": 70
  },
  "init": {
    "ban": [
      [
        [
          1,
          "bi"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "bh"
        ]
      ],
      [
        [
          1,
          "bj"
        ],
        [
          1,
          "bg"
        ],
        [
          0,
          "bg"
        ],
        [
          0,
          "bj"
        ]
      ],
      [
        [
          1,
          "bh"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "bi"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "どうぶつしょうぎ",
  "nari": {
    "bg": "bk",
    "bh": null,
    "bi": null,
    "bj": null
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000020")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000021")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000022")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000023")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000024")
    }
  ],
  "size": [
    3,
    4
  ],
  "strategy": {
    "Judge": {
      "Try": {
        "species": [
          "bj"
        ]
      },
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "Promotion": {
      "Normal": {
        "dan": 1
      }
    }
  },
  "winkoma": [
    "bj"
  ]
});
db.getCollection("rule").insert({
  "_id": 22,
  "abstract": "裸王と同じ配置だが、裸の王が獅子王に置き換わっている。獅子王は、１度に２回動かすことができる。（１回でも可）１回だけの場合は１回目着手時に右クリック。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "bl"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ]
  },
  "komaochi": true,
  "name": "獅子王",
  "players": [
    1,
    0
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    }
  },
  "winkoma": [
    "ah",
    "bl"
  ]
});
db.getCollection("rule").insert({
  "_id": 23,
  "abstract": "平手の配置で５五にコインがおかれている。コインは駒の動きとシンクロし、コインが他の駒に重なったり盤外に出てしまうような手は指せない。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          9,
          "bn"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "コイン将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MoveEffect": {
      "Coin": {
        "coin": "bn"
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 26,
  "abstract": "真下のマスに味方の駒があった場合、その駒の動きになる。ない場合は普通の動き。初手に歩が成り込むのを防ぐため、飛車と角の前の歩は最初から１つ進んだ位置にある。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "安南将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "KomaSuggest": "Annan"
  }
});
db.getCollection("rule").insert({
  "_id": 27,
  "incomplete": true,
  "abstract": "４人で時計回りに指す。ただし王手がかかった場合はかけられた人に手番が移る。最後まで詰まされなかった人の勝ち。裏王未実装。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "img": {
    "height": 48,
    "width": 48
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          3,
          "ad"
        ],
        [
          3,
          "ae"
        ],
        [
          3,
          "ah"
        ],
        [
          3,
          "ae"
        ],
        [
          3,
          "ad"
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          3,
          "aa"
        ],
        [
          3,
          "ag"
        ],
        [
          3,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          3,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          2,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          2,
          "aa"
        ],
        [
          2,
          "ag"
        ],
        [
          2,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          2,
          "ad"
        ],
        [
          2,
          "ae"
        ],
        [
          2,
          "ah"
        ],
        [
          2,
          "ae"
        ],
        [
          2,
          "ad"
        ],
        [
          
        ],
        [
          
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "四人将棋",
  "noRoom": true,
  "players": [
    0,
    2,
    1,
    3
  ],
  "strategy": null,
  "yonin": 1
});
db.getCollection("rule").insert({
  "_id": 28,
  "abstract": "とれる駒があったら必ず取らなくてはならない。ただし、取る事で王が自殺してしまう場合は取らなくていい。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "取る一手将棋",
  "strategy": {
    "CaptureControl": {
      "Toruichi": true
    },
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 30,
  "abstract": "飛角金香を落とすが、上手の銀を取ることができない。ただし成銀なら取れる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "komaochi": true,
  "name": "取らず銀",
  "players": [
    1,
    0
  ],
  "strategy": {
    "CaptureControl": {
      "Torazu": [
        [
          1,
          "ad"
        ]
      ]
    }
  }
});
db.getCollection("rule").insert({
  "_id": 31,
  "abstract": "お互いに銀はとれない。ただし成銀なら取れる",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "相取らず銀",
  "strategy": {
    "CaptureControl": {
      "Torazu": [
        [
          null,
          "ad"
        ]
      ]
    }
  }
});
db.getCollection("rule").insert({
  "_id": 32,
  "abstract": "斜めになっている。成れる位置は変則的なので未実装。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "bw"
        ],
        [
          1,
          "bt"
        ],
        [
          1,
          "bs"
        ],
        [
          1,
          "br"
        ],
        [
          1,
          "bq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          1,
          "bt"
        ],
        [
          
        ],
        [
          
        ],
        [
          1,
          "bu"
        ],
        [
          1,
          "bp"
        ],
        [
          1,
          "bp"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          1,
          "bs"
        ],
        [
          
        ],
        [
          
        ],
        [
          1,
          "bp"
        ],
        [
          1,
          "bp"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          1,
          "br"
        ],
        [
          1,
          "bv"
        ],
        [
          1,
          "bp"
        ],
        [
          1,
          "bp"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "bp"
        ],
        [
          
        ]
      ],
      [
        [
          1,
          "bq"
        ],
        [
          1,
          "bp"
        ],
        [
          1,
          "bp"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "bp"
        ],
        [
          0,
          "bp"
        ],
        [
          0,
          "bq"
        ]
      ],
      [
        [
          
        ],
        [
          1,
          "bp"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "bp"
        ],
        [
          0,
          "bp"
        ],
        [
          0,
          "bv"
        ],
        [
          0,
          "br"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "bp"
        ],
        [
          0,
          "bp"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "bs"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "bp"
        ],
        [
          0,
          "bp"
        ],
        [
          0,
          "bu"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "bt"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "bq"
        ],
        [
          0,
          "br"
        ],
        [
          0,
          "bs"
        ],
        [
          0,
          "bt"
        ],
        [
          0,
          "bw"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "bp",
    "bq",
    "br",
    "bs",
    "bt",
    "bu",
    "bv",
    "bw",
    "bx",
    "by",
    "bz",
    "ca",
    "cb",
    "cc"
  ],
  "name": "斜め将棋(成り未実装)",
  "nari": {
    "bp": "bx",
    "bq": "by",
    "br": "bz",
    "bs": null,
    "bu": "cb",
    "bv": "cc",
    "bw": null
  },
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000029")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00002a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00002b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00002c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00002e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00002f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000031")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000032")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000033")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000034")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000035")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000036")
    }
  ],
  "strategy": {
    "Nifu": "Naname",
    "Promotion": {
      "Naname": {
        "dan": 6
      }
    }
  },
  "winkoma": [
    "bw"
  ]
});
db.getCollection("rule").insert({
  "_id": 34,
  "abstract": "先に王手すれば勝ち。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "王手将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "fatal": true
      },
      "Tsumi": {
        "ignore": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 35,
  "abstract": "先に持ち駒を３枚にすれば勝ち",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "三枚目",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      }
    },
    "MochigomaControl": {
      "WinThird": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 36,
  "abstract": "取られた駒は初期位置のうち最も近い所に戻る。もしそこが埋まっていたら取った方の持ち駒になる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "キルケ",
  "strategy": {
    "Capture": {
      "Kiruke": true
    },
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 37,
  "abstract": "角は反射して移動できる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "iterator": {
    "BanScan": {
      "Reflect": [
        
      ]
    }
  },
  "name": "反射角",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      }
    },
    "Promotion": {
      "Normal": {
        "illegal": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 38,
  "abstract": "王将だけ１筋から９筋へ移動できる。（王将のみループ将棋適用）",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "iterator": {
    "BanScan": {
      "Loop": {
        "only": [
          "ah"
        ]
      }
    }
  },
  "name": "フットワーク",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 40,
  "abstract": "同士の駒（同じ駒）の利きがぶつかったらお互い動けない。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "マドラシ",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MoveControl": {
      "Madras": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 41,
  "abstract": "１筋と９筋、１段目と９段目がつながっている。(要バランス調整)",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ],
        [
          
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "iterator": {
    "BanScan": {
      "Donut": [
        
      ]
    }
  },
  "name": "ドーナツ将棋",
  "size": [
    9,
    11
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 42,
  "abstract": "味方の駒で敵の駒を縦・横・斜めに挟んだ場合、その敵の駒は味方の向きにかわる。 ",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "オセロ将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MoveEffect": {
      "Othello": true
    },
    "Nifu": {
      "Penalty": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 45,
  "extend": {
    "$ref": "rule",
    "$id": 44
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ch"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          1,
          "ci"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ci"
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ch"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "京将棋(右京配置)",
  "strategy": null
});
db.getCollection("rule").insert({
  "_id": 48,
  "abstract": "12x12。２１種類の駒がある。",
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cr"
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "cl"
        ],
        [
          
        ],
        [
          1,
          "cs"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cs"
        ],
        [
          
        ],
        [
          0,
          "cl"
        ]
      ],
      [
        [
          1,
          "ci"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ci"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "am"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "am"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "cn"
        ],
        [
          1,
          "an"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "an"
        ],
        [
          0,
          "cn"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          1,
          "co"
        ],
        [
          1,
          "bl"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ct"
        ],
        [
          0,
          "cp"
        ],
        [
          0,
          "cf"
        ]
      ],
      [
        [
          1,
          "cf"
        ],
        [
          1,
          "cp"
        ],
        [
          1,
          "ct"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "bl"
        ],
        [
          0,
          "co"
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "cn"
        ],
        [
          1,
          "an"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "an"
        ],
        [
          0,
          "cn"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "am"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "am"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ci"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ci"
        ]
      ],
      [
        [
          1,
          "cl"
        ],
        [
          
        ],
        [
          1,
          "cs"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cs"
        ],
        [
          
        ],
        [
          0,
          "cl"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cr"
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai",
    "am",
    "an",
    "bl",
    "cf",
    "cg",
    "ci",
    "cl",
    "cm",
    "cn",
    "co",
    "cp",
    "cq",
    "cr",
    "cs",
    "ct",
    "cu",
    "cv",
    "cw",
    "cx",
    "cy",
    "cz",
    "db",
    "de",
    "df",
    "dg",
    "dh",
    "dj",
    "dk",
    "dl",
    "dm"
  ],
  "name": "中将棋",
  "nari": {
    "aa": "ai",
    "ab": "cu",
    "ad": "de",
    "ae": "ag",
    "af": "dl",
    "ag": "dm",
    "ah": null,
    "am": "cz",
    "an": "db",
    "bl": null,
    "cf": "cg",
    "ci": "df",
    "cl": "dg",
    "cm": "cv",
    "cn": "cw",
    "co": "dh",
    "cp": "dj",
    "cq": "dk",
    "cr": "cx",
    "cs": "cy",
    "ct": null
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000025")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000039")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000040")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000041")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000042")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000043")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000044")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000045")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000046")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000047")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000048")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000049")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000052")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000053")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000054")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000055")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000057")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000058")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000059")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005a")
    }
  ],
  "size": [
    12,
    12
  ],
  "strategy": {
    "CaptureControl": {
      "Shishi": true
    },
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "NoUse": true
    },
    "Promotion": {
      "Normal": {
        "dan": 4
      }
    }
  },
  "winkoma": [
    "ah",
    "cg"
  ]
});
db.getCollection("rule").insert({
  "_id": 49,
  "abstract": "15x15。29種類の駒がある。",
  "img": {
    "height": 38,
    "width": 34
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "du"
        ],
        [
          1,
          "dv"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "dv"
        ],
        [
          0,
          "du"
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "dq"
        ],
        [
          1,
          "dt"
        ],
        [
          
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cr"
        ],
        [
          
        ],
        [
          0,
          "dt"
        ],
        [
          0,
          "dq"
        ]
      ],
      [
        [
          1,
          "dp"
        ],
        [
          
        ],
        [
          1,
          "ds"
        ],
        [
          1,
          "cs"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cs"
        ],
        [
          0,
          "ds"
        ],
        [
          
        ],
        [
          0,
          "dp"
        ]
      ],
      [
        [
          1,
          "ci"
        ],
        [
          1,
          "cl"
        ],
        [
          
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          
        ],
        [
          0,
          "cl"
        ],
        [
          0,
          "ci"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "dr"
        ],
        [
          1,
          "am"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "am"
        ],
        [
          0,
          "dr"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "cn"
        ],
        [
          1,
          "co"
        ],
        [
          1,
          "an"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "an"
        ],
        [
          0,
          "cp"
        ],
        [
          0,
          "cn"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          1,
          "cf"
        ],
        [
          1,
          "bl"
        ],
        [
          1,
          "ct"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ct"
        ],
        [
          0,
          "bl"
        ],
        [
          0,
          "cf"
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "cn"
        ],
        [
          1,
          "cp"
        ],
        [
          1,
          "an"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "an"
        ],
        [
          0,
          "co"
        ],
        [
          0,
          "cn"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "dr"
        ],
        [
          1,
          "am"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "am"
        ],
        [
          0,
          "dr"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ci"
        ],
        [
          1,
          "cl"
        ],
        [
          
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          
        ],
        [
          0,
          "cl"
        ],
        [
          0,
          "ci"
        ]
      ],
      [
        [
          1,
          "dp"
        ],
        [
          
        ],
        [
          1,
          "ds"
        ],
        [
          1,
          "cs"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cs"
        ],
        [
          0,
          "ds"
        ],
        [
          
        ],
        [
          0,
          "dp"
        ]
      ],
      [
        [
          1,
          "dq"
        ],
        [
          1,
          "dt"
        ],
        [
          
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cr"
        ],
        [
          
        ],
        [
          0,
          "dt"
        ],
        [
          0,
          "dq"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "du"
        ],
        [
          1,
          "dv"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "dv"
        ],
        [
          0,
          "du"
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai",
    "am",
    "an",
    "bl",
    "cf",
    "cg",
    "ci",
    "cl",
    "cm",
    "cn",
    "co",
    "cp",
    "cq",
    "cr",
    "cs",
    "ct",
    "cu",
    "cv",
    "cw",
    "cx",
    "cy",
    "cz",
    "db",
    "de",
    "df",
    "dg",
    "dh",
    "dj",
    "dk",
    "dl",
    "dm",
    "do",
    "dp",
    "dq",
    "dr",
    "ds",
    "dt",
    "du",
    "dv"
  ],
  "name": "大将棋",
  "nari": {
    "aa": "ai",
    "ab": "cu",
    "ac": "do",
    "ad": "de",
    "ae": "ag",
    "af": "dl",
    "ag": "dm",
    "ah": null,
    "am": "cz",
    "an": "db",
    "bl": null,
    "cf": "cg",
    "ci": "df",
    "cl": "dg",
    "cm": "cv",
    "cn": "cw",
    "co": "dh",
    "cp": "dj",
    "cq": "dk",
    "cr": "cx",
    "cs": "cy",
    "ct": null,
    "dp": "do",
    "dq": "do",
    "dr": "do",
    "ds": "do",
    "dt": "do",
    "du": "do",
    "dv": "do"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000025")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000039")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000040")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000041")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000042")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000043")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000044")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000045")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000046")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000047")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000048")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000049")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000052")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000053")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000054")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000055")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000057")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000058")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000059")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000060")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000061")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000062")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000063")
    }
  ],
  "size": [
    15,
    15
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "NoUse": true
    },
    "Promotion": {
      "Normal": {
        "dan": 5
      }
    }
  },
  "winkoma": [
    "ah",
    "cg"
  ]
});
db.getCollection("rule").insert({
  "_id": 50,
  "abstract": "11x11。17種類の駒がある。",
  "init": {
    "ban": [
      [
        [
          1,
          "eg"
        ],
        [
          
        ],
        [
          1,
          "em"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "em"
        ],
        [
          
        ],
        [
          0,
          "dx"
        ]
      ],
      [
        [
          1,
          "ef"
        ],
        [
          1,
          "ej"
        ],
        [
          1,
          "em"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "em"
        ],
        [
          0,
          "eh"
        ],
        [
          0,
          "dy"
        ]
      ],
      [
        [
          1,
          "ee"
        ],
        [
          
        ],
        [
          1,
          "em"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "em"
        ],
        [
          
        ],
        [
          0,
          "dz"
        ]
      ],
      [
        [
          1,
          "ed"
        ],
        [
          
        ],
        [
          1,
          "el"
        ],
        [
          1,
          "em"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "em"
        ],
        [
          0,
          "ek"
        ],
        [
          
        ],
        [
          0,
          "ea"
        ]
      ],
      [
        [
          1,
          "ec"
        ],
        [
          
        ],
        [
          1,
          "em"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "em"
        ],
        [
          
        ],
        [
          0,
          "eb"
        ]
      ],
      [
        [
          1,
          "dw"
        ],
        [
          1,
          "ei"
        ],
        [
          1,
          "em"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "em"
        ],
        [
          0,
          "ei"
        ],
        [
          0,
          "dw"
        ]
      ],
      [
        [
          1,
          "eb"
        ],
        [
          
        ],
        [
          1,
          "em"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "em"
        ],
        [
          
        ],
        [
          0,
          "ec"
        ]
      ],
      [
        [
          1,
          "ea"
        ],
        [
          
        ],
        [
          1,
          "ek"
        ],
        [
          1,
          "em"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "em"
        ],
        [
          0,
          "el"
        ],
        [
          
        ],
        [
          0,
          "ed"
        ]
      ],
      [
        [
          1,
          "dz"
        ],
        [
          
        ],
        [
          1,
          "em"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "em"
        ],
        [
          
        ],
        [
          0,
          "ee"
        ]
      ],
      [
        [
          1,
          "dy"
        ],
        [
          1,
          "eh"
        ],
        [
          1,
          "em"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "em"
        ],
        [
          0,
          "ej"
        ],
        [
          0,
          "ef"
        ]
      ],
      [
        [
          1,
          "dx"
        ],
        [
          
        ],
        [
          1,
          "em"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "em"
        ],
        [
          
        ],
        [
          0,
          "eg"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "dw",
    "dx",
    "dy",
    "dz",
    "ea",
    "eb",
    "ec",
    "ed",
    "ee",
    "ef",
    "eg",
    "eh",
    "ei",
    "ej",
    "ek",
    "el",
    "em",
    "en",
    "eo",
    "ep",
    "eq",
    "er",
    "es",
    "et",
    "eu",
    "ev",
    "ew",
    "ex",
    "ey",
    "ez",
    "fa"
  ],
  "name": "和将棋",
  "nari": {
    "dw": null,
    "dx": "en",
    "dy": "eo",
    "dz": "ep",
    "ea": "eq",
    "eb": "er",
    "ec": "es",
    "ed": "et",
    "ee": "eu",
    "ef": "ev",
    "eg": "ew",
    "eh": null,
    "ei": "ex",
    "ej": "ey",
    "ek": "ez",
    "el": null,
    "em": "fa"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000064")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000065")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000066")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000067")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000068")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000069")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00006a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00006b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00006c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00006d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00006e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00006f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000070")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000071")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000072")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000073")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000074")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000075")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000076")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000077")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000078")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000079")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00007a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00007b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00007c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00007d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00007e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00007f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000080")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000081")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000082")
    }
  ],
  "size": [
    11,
    11
  ],
  "strategy": {
    "MochigomaIO": {
      "NoUse": true
    }
  },
  "winkoma": [
    "dw"
  ]
});
db.getCollection("rule").insert({
  "_id": 53,
  "abstract": "持ち駒が５枚に達すると負け。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "資本還元将棋",
  "strategy": {
    "MochigomaControl": {
      "LoseFifth": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 54,
  "abstract": "持ち駒を使わない将棋。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "持ち駒不使用将棋",
  "strategy": {
    "MochigomaIO": {
      "NoUse": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 55,
  "abstract": "真上のマスに味方の駒があった場合、その駒の動きになる。ない場合は普通の動き。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "安北将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "KomaSuggest": {
      "Anhoku": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 65,
  "abstract": "本将棋の歩を仲人に置き換えたもの。",
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai",
    "aj",
    "ak",
    "al",
    "am",
    "an",
    "cq"
  ],
  "name": "仲人将棋",
  "nari": {
    "ab": "aj",
    "ac": "ak",
    "ad": "al",
    "ae": null,
    "af": "am",
    "ag": "an",
    "ah": null,
    "cq": "ai"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000044")
    }
  ],
  "size": [
    9,
    9
  ],
  "strategy": null,
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 66,
  "abstract": "同じ駒を何手も動かせる。ただし、駒取りや成りは１手目のみ可能。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "スピード将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      }
    },
    "CaptureControl": {
      "Speed": true
    },
    "MoveControl": {
      "Same": true
    },
    "Promotion": {
      "Speed": true
    },
    "TebanRotation": {
      "Speed": true
    }
  },
  incomplete: true
});
db.getCollection("rule").insert({
  "_id": 67,
  "abstract": "ある駒の利きに味方の駒がある場合、元の駒がその駒の利きに移動できる(=連鎖)。再帰的に連鎖することも可能。最低１回は連鎖しなくてはならない。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "連鎖移動将棋",
  "noRoom": true,
  "rensa": true,
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "Destination": {
      "Chain": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 68,
  "abstract": "安南と連鎖移動を同時に適用。つまり、ある駒の利きに味方の駒がある場合、元の駒がその駒の利きにも移動できる(=連鎖)。再帰的に連鎖することも可能。最低１回は連鎖しなくてはならない。また、ある駒の真後ろに味方の駒があった場合、その種類の駒の動きになる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "安南連鎖移動将棋",
  "noRoom": true,
  "rensa": true,
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "KomaSuggest": {
      "Annan": true
    },
    "Destination": {
      "Chain": true
    }
  },
  incomplete: true
});
db.getCollection("rule").insert({
  "_id": 71,
  "abstract": "敵味方関わらず駒が縦に複数並んだとき、上からn番目の駒の性能が下からn番目の駒の性能になる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "ネコネコ鮮将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "KomaSuggest": {
      "Nekonekosen": true
    },
    "Promotion": {
      "Normal": {
        "illegal": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 72,
  "abstract": "敵味方の駒が目の前に向かい合ったとき、性能がいれかわる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "対面将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "KomaSuggest": {
      "Taimen": true
    },
    "Promotion": {
      "Normal": {
        "illegal": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 74,
  "abstract": "敵の駒が真後ろにあったとき、互いの性能がいれかわる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "背面将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "KomaSuggest": {
      "Haimen": true
    },
    "Promotion": {
      "Normal": {
        "illegal": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 88,
  "abstract": "後方に下がるような手を指すことができない将棋。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "突撃将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      }
    },
    "MoveFilter": {
      "Dash": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 89,
  incomplete: true,
  "abstract": "７目並べ。ただし、相手の石を囲むと取り去ることができる、コウ禁止、自殺手禁止など囲碁のルールを受け継ぐ。ただし自殺手で７目並ぶ場合は合法手となる。",
  "css": "igo",
  "img": {
    "height": 30,
    "width": 30
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "囲連星",
  "nari": [
    
  ],
  "noreverse": "koma",
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e490b014325a21249000059")
    }
  ],
  "size": [
    19,
    19
  ],
  "strategy": {
    "Judge": {
      "Gomoku": {
        "moku": 7
      }
    },
    "MochigomaIO": {
      "Infinity": {
        "autoput": true
      }
    },
    "MoveControl": {
      "Igo": true
    },
    "MoveEffect": {
      "Igo": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 91,
  "abstract": "広い。",
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai",
    "aj",
    "ak",
    "al",
    "am",
    "an"
  ],
  "name": "広い将棋",
  "nari": {
    "aa": "ai",
    "ab": "aj",
    "ac": "ak",
    "ad": "al",
    "ae": null,
    "af": "am",
    "ag": "an",
    "ah": null
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    }
  ],
  "size": [
    11,
    11
  ],
  "strategy": null,
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 92,
  "abstract": "王以外飛車。",
  "init": {
    "ban": [
      [
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ag"
        ],
        [
          
        ],
        [
          0,
          "ag"
        ]
      ],
      [
        [
          1,
          "ag"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ag"
        ]
      ],
      [
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ag"
        ],
        [
          
        ],
        [
          0,
          "ag"
        ]
      ],
      [
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ag"
        ],
        [
          
        ],
        [
          0,
          "ag"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ag"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ag"
        ],
        [
          
        ],
        [
          0,
          "ag"
        ]
      ],
      [
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ag"
        ],
        [
          
        ],
        [
          0,
          "ag"
        ]
      ],
      [
        [
          1,
          "ag"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ag"
        ]
      ],
      [
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ag"
        ],
        [
          
        ],
        [
          0,
          "ag"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "ag",
    "ah",
    "an"
  ],
  "name": "飛車将棋",
  "nari": {
    "ag": "an",
    "ah": null
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    }
  ],
  "size": [
    9,
    9
  ],
  "strategy": null,
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 94,
  "abstract": "駒に対して八方桂の位置にある駒全ての種類の動きができる．",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "安騎将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "KomaSuggest": {
      "Anki": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 95,
  "abstract": "左右のマスに味方の駒があった場合、その駒の動きになる。どちらにもない場合は普通の動き。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "安東西将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      }
    },
    "KomaSuggest": {
      "Antouzai": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 96,
  "abstract": "5x6で、王金銀歩の４種類の駒を使う将棋。2段目で成れる。",
  "init": {
    "ban": [
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ad",
    "ae",
    "ah",
    "ai",
    "al"
  ],
  "name": "ゴロゴロ将棋",
  "nari": {
    "aa": "ai",
    "ad": "al",
    "ae": null,
    "ah": null
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    }
  ],
  "size": [
    5,
    6
  ],
  "strategy": {
    "Promotion": {
      "Normal": {
        "dan": 2
      }
    }
  },
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 97,
  "abstract": "5x6で、王金銀歩の４種類の駒を使うゴロゴロ将棋に、桂香の持ち駒を追加したもの。2段目で成れる。",
  "init": {
    "ban": [
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ]
    ],
    "mochigoma": [
      {
        "ab": 1,
        "ac": 1
      },
      {
        "ab": 1,
        "ac": 1
      }
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "ah",
    "ai",
    "aj",
    "ak",
    "al"
  ],
  "name": "ゴロゴロ将棋+桂香",
  "nari": {
    "aa": "ai",
    "ab": "aj",
    "ac": "ak",
    "ad": "al",
    "ae": null,
    "ah": null
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    }
  ],
  "size": [
    5,
    6
  ],
  "strategy": {
    "Promotion": {
      "Normal": {
        "dan": 2
      }
    }
  },
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 98,
  "abstract": "4x5、王角金銀歩の４種類の駒を使う将棋。駒をとったら成り、歩は桂、銀は香、金は飛、角はと金に成る。打ち歩詰めは可能。五分摩訶将棋とも呼ばれる。",
  "init": {
    "ban": [
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "af"
        ]
      ],
      [
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai"
  ],
  "name": "マイクロ将棋",
  "nari": {
    "aa": "ac",
    "ad": "ab",
    "ae": "ag",
    "af": "ai",
    "ah": null
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    }
  ],
  "size": [
    4,
    5
  ],
  "strategy": {
    "Judge": {
      "Tsumi": {
        "uchifu": true
      }
    },
    "MochigomaIO": {
      "BothFace": true
    },
    "Nifu": {
      "No": true
    },
    "Promotion": {
      "Capture": {
        "must": true,
        "reversible": true
      }
    }
  },
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 99,
  "abstract": "中国将棋とも呼ばれる。4〜6筋の手前3段目は宮であり、仕と師はそこから出られない。5段目と6段目の間には河があり、相は越えられず、兵は越えると成る。 (盤面への宮や河の表示は，駒の交点配置に対応し次第行います)",
  "init": {
    "ban": [
      [
        [
          1,
          "yv"
        ],
        [
          
        ],
        [
          
        ],
        [
          1,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yv"
        ]
      ],
      [
        [
          1,
          "yt"
        ],
        [
          
        ],
        [
          1,
          "yw"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yw"
        ],
        [
          
        ],
        [
          0,
          "yt"
        ]
      ],
      [
        [
          1,
          "yu"
        ],
        [
          
        ],
        [
          
        ],
        [
          1,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yu"
        ]
      ],
      [
        [
          1,
          "ys"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ys"
        ]
      ],
      [
        [
          1,
          "yr"
        ],
        [
          
        ],
        [
          
        ],
        [
          1,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yr"
        ]
      ],
      [
        [
          1,
          "ys"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ys"
        ]
      ],
      [
        [
          1,
          "yu"
        ],
        [
          
        ],
        [
          
        ],
        [
          1,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yu"
        ]
      ],
      [
        [
          1,
          "yt"
        ],
        [
          
        ],
        [
          1,
          "yw"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yw"
        ],
        [
          
        ],
        [
          0,
          "yt"
        ]
      ],
      [
        [
          1,
          "yv"
        ],
        [
          
        ],
        [
          
        ],
        [
          1,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yv"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "yr",
    "ys",
    "yt",
    "yu",
    "yv",
    "yw",
    "yx",
    "yy"
  ],
  "name": "シャンチー",
  "nari": {
    "yr": null,
    "ys": null,
    "yt": null,
    "yu": null,
    "yv": null,
    "yw": null,
    "yx": "yy"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000197")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000198")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000199")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019e")
    }
  ],
  "size": [
    9,
    10
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "NoUse": true
    },
    "MoveControl": {
      "NoTaimen": {
        "species": [
          "yr"
        ]
      }
    },
    "MoveFilter": {
      "Restricted": {
        "place": [
          {
            "species": [
              "yr",
              "ys"
            ],
            "min": {
              "x": 4,
              "y": 8
            },
            "max": {
              "x": 6,
              "y": 10
            }
          },
          {
            "species": [
              "yu"
            ],
            "min": {
              "x": 1,
              "y": 6
            },
            "max": {
              "x": 9,
              "y": 10
            }
          }
        ]
      }
    },
    "Promotion": {
      "Normal": {
        "must": true,
        "dan": 5
      }
    }
  },
  "winkoma": [
    "yr"
  ]
});
db.getCollection("rule").insert({
  "_id": 101,
  "abstract": "@yon_ichiroさんの案1つ目。原図: http:\/\/twitpic.com\/5hpf5n 自分から見て左2つの筋の手前3段目は宮であり、仕と師はそこから出られない。3段目と4段目の間には河があり、相は越えられず、兵は越えると成る。",
  "init": {
    "ban": [
      [
        [
          1,
          "yr"
        ],
        [
          1,
          "ys"
        ],
        [
          1,
          "yu"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yt"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yw"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          1,
          "yw"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yx"
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          1,
          "yt"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yu"
        ],
        [
          0,
          "ys"
        ],
        [
          0,
          "yr"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "yr",
    "ys",
    "yt",
    "yu",
    "yw",
    "yx",
    "yy"
  ],
  "name": "ミニシャンチー2(仮)",
  "nari": {
    "yr": null,
    "ys": null,
    "yt": null,
    "yu": null,
    "yw": null,
    "yx": "yy"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000197")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000198")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000199")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019e")
    }
  ],
  "size": [
    5,
    6
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "NoUse": true
    },
    "MoveControl": {
      "NoTaimen": {
        "species": [
          "yr"
        ]
      }
    },
    "MoveFilter": {
      "Restricted": {
        "place": [
          {
            "species": [
              "yr",
              "ys"
            ],
            "min": {
              "x": 4,
              "y": 4
            },
            "max": {
              "x": 5,
              "y": 6
            }
          },
          {
            "species": [
              "yu"
            ],
            "min": {
              "x": 1,
              "y": 4
            },
            "max": {
              "x": 5,
              "y": 6
            }
          }
        ]
      }
    },
    "Promotion": {
      "Normal": {
        "must": true
      }
    }
  },
  "winkoma": [
    "yr"
  ]
});
db.getCollection("rule").insert({
  "_id": 104,
  "abstract": "囲碁は石を無限に打て，囲むと相手の駒を取れる．取った駒を使える．取った駒を使って囲むこともできる．将棋は囲碁側に四方を囲まれた地点へ移動することができない．",
  "init": {
    "ban": [
      [
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "yn"
        ],
        [
          1,
          "yn"
        ],
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "yn"
        ],
        [
          1,
          "yn"
        ],
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          1,
          "yn"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      {
        "yn": 1
      }
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai",
    "aj",
    "ak",
    "al",
    "am",
    "an",
    "yn"
  ],
  "name": "将棋対囲碁",
  "nari": {
    "aa": "ai",
    "ab": "aj",
    "ac": "ak",
    "ad": "al",
    "ae": null,
    "af": "am",
    "ag": "an",
    "ah": null,
    "yn": null
  },
  "override": 0,
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    }
  ],
  "size": [
    9,
    9
  ],
  "strategy": {
    "Judge": {
      "Tsumi": {
        "ignore": true
      },
      "Oute": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "Infinity": {
        "species": "yn",
        "common": {
          "directions": [
            1
          ]
        }
      },
      "Normal": {
        "common": {
          "directions": [
            0
          ]
        }
      }
    },
    "MoveControl": {
      "Igo": {
        "common": {
          "directions": [
            0
          ]
        }
      },
      "Normal": {
        "common": {
          "directions": [
            1
          ]
        }
      }
    },
    "MoveEffect": {
      "FlipPut": {
        "species": "yn",
        "common": {
          "directions": [
            0
          ]
        }
      },
      "Igo": {
        "common": {
          "directions": [
            1
          ]
        }
      }
    }
  },
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 105,
  "abstract": "縦横で挟んだらとれる。複数も可。端で敵駒を動けないように囲んでもとれる。相手の駒を４枚以下にしたら勝ち。",
  "init": {
    "ban": [
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ],
      [
        [
          1,
          "ce"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cd"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "cd",
    "ce"
  ],
  "name": "はさみ天秤端落とし",
  "nari": {
    "cd": null,
    "ce": null
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000037")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000038")
    }
  ],
  "size": [
    9,
    9
  ],
  "strategy": {
    "Judge": {
      "Count": {
        "lte": 4
      }
    },
    "MoveEffect": {
      "HasamiTenbinHashiotoshi": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 106,
  "abstract": "前後左右に敵駒がいると接着して同時に動く。接着した駒が他の駒と重なるように動くことは出来ない。",
  "eatfriend": true,
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "iterator": {
    "BanScan": {
      "Epoxy": true
    }
  },
  "name": "エポキシ将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MoveEffect": {
      "Epoxy": {
        "fatal": true
      }
    },
    "Nifu": {
      "Whole": [
        
      ]
    }
  }
});
db.getCollection("rule").insert({
  "_id": 69,
  "abstract": "駒を取った駒は初期位置のうち最も近い所に戻る。もしそこが埋まっていたら戻らずにそのままとなる",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "アンチキルケ",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MoveEffect": {
      "Antikiruke": [
        
      ]
    }
  }
});
db.getCollection("rule").insert({
  "_id": 108,
  "abstract": "駒が量子状態にある。すなわち、最初にあらゆる種類の駒である可能性を持っており、移動するたびにあり得ない駒が除かれ種類が定まっていく。枚数配分は先手後手それぞれ本将棋と同じ。駒を取るとその駒が王である可能性が排除される。王に確定した駒をとれば勝ち。二歩・王手放置は許可。",
  "init": {
    "ban": [
      [
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ff"
        ],
        [
          
        ],
        [
          0,
          "ff"
        ]
      ],
      [
        [
          1,
          "ff"
        ],
        [
          1,
          "ff"
        ],
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ff"
        ],
        [
          0,
          "ff"
        ],
        [
          0,
          "ff"
        ]
      ],
      [
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ff"
        ],
        [
          
        ],
        [
          0,
          "ff"
        ]
      ],
      [
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ff"
        ],
        [
          
        ],
        [
          0,
          "ff"
        ]
      ],
      [
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ff"
        ],
        [
          
        ],
        [
          0,
          "ff"
        ]
      ],
      [
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ff"
        ],
        [
          
        ],
        [
          0,
          "ff"
        ]
      ],
      [
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ff"
        ],
        [
          
        ],
        [
          0,
          "ff"
        ]
      ],
      [
        [
          1,
          "ff"
        ],
        [
          1,
          "ff"
        ],
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ff"
        ],
        [
          0,
          "ff"
        ],
        [
          0,
          "ff"
        ]
      ],
      [
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          1,
          "ff"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ff"
        ],
        [
          
        ],
        [
          0,
          "ff"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "js": "quantum",
  "koma": [
    "ff",
    "fg"
  ],
  "name": "量子将棋",
  "nari": {
    "ff": "fg"
  },
  "players": [
    0,
    1
  ],
  "rewriteall": true,
  "size": [
    9,
    9
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "KomaSuggest": {
      "Quantum": {
        "hoge": 1
      }
    },
    "MoveEffect": {
      "Quantum": {
        "hoge": 1
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 109,
  "abstract": "歩を取り除いた普通の将棋。将棋の入門用に良いとされるルール。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "歩なし将棋"
});
db.getCollection("rule").insert({
  "_id": 111,
  "abstract": "成れない将棋。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "nari": {
    "aa": null,
    "ab": null,
    "ac": null,
    "ad": null,
    "ae": null,
    "af": null,
    "ag": null,
    "ah": null
  },
  "name": "不成将棋"
});
db.getCollection("rule").insert({
  "_id": 110,
  "abstract": "(調整中)",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "noRoom": true,
  "name": "(調整中)"
});
db.getCollection("rule").insert({
  "_id": 0,
  "abstract": "普通の将棋。",
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai",
    "aj",
    "ak",
    "al",
    "am",
    "an"
  ],
  "name": "本将棋(平手)",
  "nari": {
    "aa": "ai",
    "ab": "aj",
    "ac": "ak",
    "ad": "al",
    "ae": null,
    "af": "am",
    "ag": "an",
    "ah": null
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    }
  ],
  "size": [
    9,
    9
  ],
  "strategy": null,
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 1,
  "abstract": "普通の将棋から、上手側の左の香車を落としたもの。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ]
  },
  "komaochi": true,
  "name": "本将棋(香落ち)",
  "players": [
    1,
    0
  ],
  "strategy": null
});
db.getCollection("rule").insert({
  "_id": 4,
  "abstract": "普通の将棋から、上手側の飛車と左の香車を落としたもの。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ]
  },
  "komaochi": true,
  "name": "本将棋(飛車香落ち)",
  "players": [
    1,
    0
  ],
  "strategy": null
});
db.getCollection("rule").insert({
  "_id": 7,
  "abstract": "普通の将棋から、上手側の飛車・角を１枚ずつ、香・桂を２枚ずつ（＝六枚）を落としたもの。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ]
  },
  "komaochi": true,
  "name": "本将棋(六枚落ち)",
  "players": [
    1,
    0
  ],
  "strategy": null
});
db.getCollection("rule").insert({
  "_id": 8,
  "abstract": "普通の将棋から、上手側の飛車・角を１枚ずつ、香・桂・銀を２枚ずつ（＝八枚）を落としたもの。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ]
  },
  "komaochi": true,
  "name": "本将棋(八枚落ち)",
  "players": [
    1,
    0
  ],
  "strategy": null
});
db.getCollection("rule").insert({
  "_id": 10,
  "abstract": "上手側は王将のみで、持ち駒が歩三枚。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      {
        "aa": 3
      }
    ]
  },
  "komaochi": true,
  "name": "本将棋(歩三兵)",
  "players": [
    1,
    0
  ],
  "strategy": null
});
db.getCollection("rule").insert({
  "_id": 11,
  "abstract": "上手側は王将のみ。十九枚落ちともいう。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ]
  },
  "komaochi": true,
  "name": "本将棋(裸王)",
  "players": [
    1,
    0
  ],
  "strategy": null
});
db.getCollection("rule").insert({
  "_id": 12,
  "abstract": "平安時代に指された将棋。いくつか説があるなかで盤を8x8と想定したもの。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "ah"
  ],
  "name": "平安将棋(8x8)",
  "nari": {
    "aa": "ae",
    "ab": "ae",
    "ac": "ae",
    "ad": "ae",
    "ae": null,
    "ah": null
  },
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    }
  ],
  "size": [
    8,
    8
  ],
  "strategy": {
    "MochigomaIO": {
      "NoUse": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 13,
  "abstract": "平安時代に指された将棋。いくつか説があるなかで盤を9x8と想定したもの。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "ah"
  ],
  "name": "平安将棋(9x8)",
  "nari": {
    "aa": "ae",
    "ab": "ae",
    "ac": "ae",
    "ad": "ae",
    "ae": null,
    "ah": null
  },
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    }
  ],
  "size": [
    9,
    8
  ],
  "strategy": {
    "MochigomaIO": {
      "NoUse": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 14,
  "abstract": "平安時代に指された将棋。いくつか説があるなかで盤を9x9と想定したもの。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "ah"
  ],
  "name": "平安将棋(9x9)",
  "nari": {
    "aa": "ae",
    "ab": "ae",
    "ac": "ae",
    "ad": "ae",
    "ae": null,
    "ah": null
  },
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    }
  ],
  "size": [
    9,
    9
  ],
  "strategy": {
    "MochigomaIO": {
      "NoUse": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 15,
  "abstract": "13x13。平安時代に指された将棋。現代の本将棋にはない駒もいくつか見られる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "at"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "at"
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "as"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "as"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ap"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ap"
        ]
      ],
      [
        [
          1,
          "ao"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ao"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          1,
          "ar"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ar"
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          1,
          "aq"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "au"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "au"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "aq"
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          1,
          "ar"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ar"
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ao"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ao"
        ]
      ],
      [
        [
          1,
          "ap"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ap"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "as"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "as"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "at"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "at"
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai",
    "aj",
    "ak",
    "al",
    "am",
    "an",
    "ao",
    "ap",
    "aq",
    "ar",
    "as",
    "at",
    "au"
  ],
  "name": "平安大将棋",
  "nari": {
    "aa": "ai",
    "ab": "aj",
    "ac": "ak",
    "ad": "al",
    "ae": null,
    "af": "am",
    "ag": "an",
    "ah": null,
    "ao": "ae",
    "ap": "ae",
    "aq": "ae",
    "ar": "ae",
    "as": "ae",
    "at": "ae",
    "au": "ae"
  },
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000010")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000011")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000012")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000013")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000014")
    }
  ],
  "size": [
    13,
    13
  ],
  "strategy": {
    "MochigomaIO": {
      "NoUse": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 18,
  "abstract": "１手指すごとに、横に重力がかかったように駒が横にすべる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "重力将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MoveEffect": {
      "Gravity": true
    },
    "Nifu": {
      "No": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 19,
  "abstract": "京都銀閣金鶏秘譜将棋ともいう。香と　銀角　金桂　飛歩　がそれぞれ裏表になっている（それが名前の由来でもある）。駒は１手動かすごとに裏返る。",
  "init": {
    "ban": [
      [
        [
          1,
          "ai"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ai"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai"
  ],
  "name": "京都銀閣将棋",
  "nari": {
    "aa": "ag",
    "ad": "af",
    "ae": "ac",
    "ah": null,
    "ai": "ab"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    }
  ],
  "size": [
    5,
    5
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "BothFace": true
    },
    "Nifu": {
      "No": true
    },
    "Promotion": {
      "All": {
        "reversible": true,
        "illegal": true,
        "must": true
      }
    }
  },
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 20,
  "abstract": "４枚落ちで、上手の側の桂馬が八方桂（４方向８カ所の桂馬の動き＝チェスのナイトの動きをする駒）になっている。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "be"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "be"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "af",
    "ag",
    "ai",
    "aj",
    "ak",
    "al",
    "am",
    "an",
    "be",
    "bf"
  ],
  "komaochi": true,
  "name": "八方桂",
  "nari": {
    "aa": "ai",
    "ab": "aj",
    "ac": "ak",
    "ad": "al",
    "af": "am",
    "ag": "an",
    "be": "bf"
  },
  "players": [
    1,
    0
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00001e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00001f")
    }
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "Exchange": [
        {
          "ac": "be"
        },
        {
          "be": "ac"
        }
      ]
    }
  }
});
db.getCollection("rule").insert({
  "_id": 21,
  "abstract": "形は平手で、すべての桂馬が八方桂になっている。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "be"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "be"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "be"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "be"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "af",
    "ag",
    "ai",
    "aj",
    "ak",
    "al",
    "am",
    "an",
    "be",
    "bf"
  ],
  "name": "相八方桂",
  "nari": {
    "aa": "ai",
    "ab": "aj",
    "ac": "ak",
    "ad": "al",
    "af": "am",
    "ag": "an",
    "be": "bf"
  },
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00001e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00001f")
    }
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 25,
  "abstract": "２手ずつ指す。ただし最初の先手のみ１手だけ。１手目に王手、２手目に王将をとってもよい。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "二手指し将棋",
  "players": [
    0,
    1,
    1,
    0
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 29,
  "abstract": "相手の利きがある駒は金縛りに遭い動けなくなる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "金縛り将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MoveControl": {
      "Freeze": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 33,
  "abstract": "１筋と９筋がつながっている。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "iterator": {
    "BanScan": {
      "Loop": [
        
      ]
    }
  },
  "name": "ループ将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 43,
  "abstract": "普通の将棋の王将の１つ上に酔象をおいて持ち駒再使用不可にしたもの。",
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          1,
          "cf"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cf"
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai",
    "aj",
    "ak",
    "al",
    "am",
    "an",
    "cf",
    "cg"
  ],
  "name": "小将棋",
  "nari": {
    "aa": "ai",
    "ab": "aj",
    "ac": "ak",
    "ad": "al",
    "ae": null,
    "af": "am",
    "ag": "an",
    "ah": null,
    "cf": "cg"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000039")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003a")
    }
  ],
  "size": [
    9,
    9
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "NoUse": true
    }
  },
  "winkoma": [
    "ah",
    "cg"
  ]
});
db.getCollection("rule").insert({
  "_id": 44,
  "abstract": "マスを10x10にし京翔、銅将を追加したもの。",
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ch"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ci"
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          1,
          "ci"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ch"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai",
    "aj",
    "ak",
    "al",
    "am",
    "an",
    "ch",
    "ci",
    "cj",
    "ck"
  ],
  "name": "京将棋(左京配置)",
  "nari": {
    "aa": "ai",
    "ab": "aj",
    "ac": "ak",
    "ad": "al",
    "ae": null,
    "af": "am",
    "ag": "an",
    "ah": null,
    "ch": "cj",
    "ci": "ck"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003e")
    }
  ],
  "size": [
    10,
    10
  ],
  "strategy": null,
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 46,
  "abstract": "普通の将棋の片方の桂馬を京翔に置き換えたもの。",
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ch"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ch"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai",
    "aj",
    "ak",
    "al",
    "am",
    "an",
    "ch",
    "cj"
  ],
  "name": "小京将棋(左京配置)",
  "nari": {
    "aa": "ai",
    "ab": "aj",
    "ac": "ak",
    "ad": "al",
    "ae": null,
    "af": "am",
    "ag": "an",
    "ah": null,
    "ch": "cj"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003d")
    }
  ],
  "size": [
    9,
    9
  ],
  "strategy": null,
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 51,
  "abstract": "5x5。1段目で成れる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ah"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ag"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "af"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ah"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "5五将棋",
  "size": [
    5,
    5
  ],
  "strategy": {
    "Promotion": {
      "Normal": {
        "dan": 1
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 52,
  "abstract": "6x6。2段目で成れる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ah"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ag"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "af"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "af"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ag"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ah"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "6六将棋",
  "size": [
    6,
    6
  ],
  "strategy": {
    "Promotion": {
      "Normal": {
        "dan": 2
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 57,
  "abstract": "先手と後手で持ち駒を共有する。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "みんなの広場",
  "strategy": {
    "MochigomaIO": {
      "Share": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 59,
  incomplete: true,
  "abstract": "16x16。36種類の駒がある。",
  "img": {
    "height": 38,
    "width": 34
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          1,
          "fj"
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cr"
        ],
        [
          0,
          "fj"
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "fi"
        ],
        [
          1,
          "cs"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cs"
        ],
        [
          0,
          "fi"
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "cl"
        ],
        [
          1,
          "fb"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "fb"
        ],
        [
          0,
          "cl"
        ]
      ],
      [
        [
          1,
          "dp"
        ],
        [
          1,
          "fb"
        ],
        [
          1,
          "am"
        ],
        [
          1,
          "cz"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cz"
        ],
        [
          0,
          "am"
        ],
        [
          0,
          "fb"
        ],
        [
          0,
          "dp"
        ]
      ],
      [
        [
          1,
          "ci"
        ],
        [
          
        ],
        [
          1,
          "an"
        ],
        [
          1,
          "db"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "fo"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "fo"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "db"
        ],
        [
          0,
          "an"
        ],
        [
          
        ],
        [
          0,
          "ci"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          1,
          "cn"
        ],
        [
          1,
          "fh"
        ],
        [
          1,
          "fn"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "fn"
        ],
        [
          0,
          "fh"
        ],
        [
          0,
          "cn"
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "co"
        ],
        [
          1,
          "fe"
        ],
        [
          1,
          "fm"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "fm"
        ],
        [
          0,
          "fe"
        ],
        [
          0,
          "cp"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          1,
          "bl"
        ],
        [
          1,
          "fc"
        ],
        [
          1,
          "fk"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "fl"
        ],
        [
          0,
          "fd"
        ],
        [
          0,
          "ct"
        ],
        [
          0,
          "cf"
        ]
      ],
      [
        [
          1,
          "cf"
        ],
        [
          1,
          "ct"
        ],
        [
          1,
          "fd"
        ],
        [
          1,
          "fl"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "fk"
        ],
        [
          0,
          "fc"
        ],
        [
          0,
          "bl"
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "cp"
        ],
        [
          1,
          "fe"
        ],
        [
          1,
          "fm"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "fm"
        ],
        [
          0,
          "fe"
        ],
        [
          0,
          "co"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          1,
          "cn"
        ],
        [
          1,
          "fh"
        ],
        [
          1,
          "fn"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "fn"
        ],
        [
          0,
          "fh"
        ],
        [
          0,
          "cn"
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ci"
        ],
        [
          
        ],
        [
          1,
          "an"
        ],
        [
          1,
          "db"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "fo"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "fo"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "db"
        ],
        [
          0,
          "an"
        ],
        [
          
        ],
        [
          0,
          "ci"
        ]
      ],
      [
        [
          1,
          "dp"
        ],
        [
          1,
          "fb"
        ],
        [
          1,
          "am"
        ],
        [
          1,
          "cz"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cz"
        ],
        [
          0,
          "am"
        ],
        [
          0,
          "fb"
        ],
        [
          0,
          "dp"
        ]
      ],
      [
        [
          1,
          "cl"
        ],
        [
          1,
          "fb"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "fb"
        ],
        [
          0,
          "cl"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "fi"
        ],
        [
          1,
          "cs"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cs"
        ],
        [
          0,
          "fi"
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          1,
          "fj"
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cr"
        ],
        [
          0,
          "fj"
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "am",
    "an",
    "bl",
    "cf",
    "cg",
    "ci",
    "cl",
    "cm",
    "cn",
    "co",
    "cp",
    "cr",
    "cs",
    "ct",
    "cu",
    "cv",
    "cw",
    "cx",
    "cy",
    "cz",
    "db",
    "dd",
    "de",
    "df",
    "dg",
    "dh",
    "dj",
    "dl",
    "dm",
    "do",
    "dp",
    "fb",
    "fc",
    "fd",
    "fe",
    "fh",
    "fi",
    "fj",
    "fk",
    "fl",
    "fm",
    "fn",
    "fo",
    "fp",
    "fq",
    "kl",
    "kn",
    "kq",
    "kr",
    "kw",
    "kx",
    "ky",
    "kz",
    "ld",
    "le"
  ],
  "name": "天竺大将棋",
  "nari": {
    "aa": "do",
    "ab": "cu",
    "ac": "ky",
    "ad": "de",
    "ae": "dd",
    "af": "dl",
    "ag": "dm",
    "ah": null,
    "am": "kl",
    "an": "kn",
    "bl": "kr",
    "cf": "cg",
    "ci": "df",
    "cl": "dg",
    "cm": "cv",
    "cn": "cw",
    "co": "dh",
    "cp": "dj",
    "cr": "cx",
    "cs": "cy",
    "ct": "fd",
    "cz": "le",
    "db": "ld",
    "dp": "kx",
    "fb": "fp",
    "fc": null,
    "fd": null,
    "fe": null,
    "fh": "fe",
    "fi": "kq",
    "fj": "kw",
    "fk": null,
    "fl": null,
    "fm": "kz",
    "fn": "fl",
    "fo": "fq"
  },
  "noRoom": true,
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000025")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000039")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000040")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000041")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000042")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000043")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000045")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000046")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000047")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000048")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000049")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000051")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000052")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000053")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000054")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000055")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000057")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000059")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000083")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000084")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000085")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000086")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000089")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00008a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00008b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00008c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00008d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00008e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00008f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000090")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000091")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000092")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000025")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000027")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900002a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900002b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000030")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000031")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000032")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000033")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000037")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000038")
    }
  ],
  "size": [
    16,
    16
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "NoUse": true
    },
    "Promotion": {
      "Normal": {
        "dan": 5
      }
    }
  },
  "winkoma": [
    "ah",
    "cg"
  ]
});
db.getCollection("rule").insert({
  "_id": 60,
  "abstract": "17x17。36種類の駒がある。",
  "img": {
    "height": 34,
    "width": 30
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          
        ],
        [
          1,
          "ht"
        ],
        [
          1,
          "hz"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hy"
        ],
        [
          0,
          "hu"
        ],
        [
          
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "gf"
        ],
        [
          1,
          "hf"
        ],
        [
          1,
          "cs"
        ],
        [
          1,
          "hs"
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cr"
        ],
        [
          0,
          "hr"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "hg"
        ],
        [
          0,
          "gh"
        ]
      ],
      [
        [
          1,
          "gd"
        ],
        [
          1,
          "bl"
        ],
        [
          
        ],
        [
          1,
          "hq"
        ],
        [
          1,
          "du"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "du"
        ],
        [
          0,
          "ho"
        ],
        [
          
        ],
        [
          0,
          "go"
        ],
        [
          0,
          "ge"
        ]
      ],
      [
        [
          1,
          "gc"
        ],
        [
          1,
          "gm"
        ],
        [
          1,
          "hk"
        ],
        [
          1,
          "hp"
        ],
        [
          1,
          "ds"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ds"
        ],
        [
          0,
          "hn"
        ],
        [
          0,
          "hj"
        ],
        [
          0,
          "gn"
        ],
        [
          0,
          "ag"
        ]
      ],
      [
        [
          1,
          "am"
        ],
        [
          1,
          "gl"
        ],
        [
          
        ],
        [
          1,
          "hm"
        ],
        [
          1,
          "dr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "dr"
        ],
        [
          0,
          "hm"
        ],
        [
          
        ],
        [
          0,
          "dv"
        ],
        [
          0,
          "gb"
        ]
      ],
      [
        [
          1,
          "ga"
        ],
        [
          1,
          "dt"
        ],
        [
          1,
          "fh"
        ],
        [
          1,
          "dq"
        ],
        [
          1,
          "hx"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "ia"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ia"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hx"
        ],
        [
          0,
          "dq"
        ],
        [
          0,
          "hi"
        ],
        [
          0,
          "gk"
        ],
        [
          0,
          "an"
        ]
      ],
      [
        [
          1,
          "ct"
        ],
        [
          1,
          "cp"
        ],
        [
          
        ],
        [
          1,
          "dp"
        ],
        [
          1,
          "cl"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cl"
        ],
        [
          0,
          "dp"
        ],
        [
          
        ],
        [
          0,
          "co"
        ],
        [
          0,
          "fz"
        ]
      ],
      [
        [
          1,
          "fy"
        ],
        [
          1,
          "ae"
        ],
        [
          1,
          "ad"
        ],
        [
          1,
          "ci"
        ],
        [
          1,
          "hw"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hw"
        ],
        [
          0,
          "ci"
        ],
        [
          0,
          "ad"
        ],
        [
          0,
          "ae"
        ],
        [
          0,
          "fx"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          1,
          "gj"
        ],
        [
          1,
          "hh"
        ],
        [
          1,
          "hl"
        ],
        [
          1,
          "hv"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hv"
        ],
        [
          0,
          "hl"
        ],
        [
          0,
          "hh"
        ],
        [
          0,
          "gj"
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "fx"
        ],
        [
          1,
          "ae"
        ],
        [
          1,
          "ad"
        ],
        [
          1,
          "ci"
        ],
        [
          1,
          "hw"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hw"
        ],
        [
          0,
          "ci"
        ],
        [
          0,
          "ad"
        ],
        [
          0,
          "ae"
        ],
        [
          0,
          "fy"
        ]
      ],
      [
        [
          1,
          "fz"
        ],
        [
          1,
          "co"
        ],
        [
          
        ],
        [
          1,
          "dp"
        ],
        [
          1,
          "cl"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cl"
        ],
        [
          0,
          "dp"
        ],
        [
          
        ],
        [
          0,
          "cp"
        ],
        [
          0,
          "ct"
        ]
      ],
      [
        [
          1,
          "an"
        ],
        [
          1,
          "gk"
        ],
        [
          1,
          "hi"
        ],
        [
          1,
          "dq"
        ],
        [
          1,
          "hx"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "ia"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ia"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hx"
        ],
        [
          0,
          "dq"
        ],
        [
          0,
          "fh"
        ],
        [
          0,
          "dt"
        ],
        [
          0,
          "ga"
        ]
      ],
      [
        [
          1,
          "gb"
        ],
        [
          1,
          "dv"
        ],
        [
          
        ],
        [
          1,
          "hm"
        ],
        [
          1,
          "dr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "dr"
        ],
        [
          0,
          "hm"
        ],
        [
          
        ],
        [
          0,
          "gl"
        ],
        [
          0,
          "am"
        ]
      ],
      [
        [
          1,
          "ag"
        ],
        [
          1,
          "gn"
        ],
        [
          1,
          "hj"
        ],
        [
          1,
          "hn"
        ],
        [
          1,
          "ds"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ds"
        ],
        [
          0,
          "hp"
        ],
        [
          0,
          "hk"
        ],
        [
          0,
          "gm"
        ],
        [
          0,
          "gc"
        ]
      ],
      [
        [
          1,
          "ge"
        ],
        [
          1,
          "go"
        ],
        [
          
        ],
        [
          1,
          "ho"
        ],
        [
          1,
          "du"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "du"
        ],
        [
          0,
          "hq"
        ],
        [
          
        ],
        [
          0,
          "bl"
        ],
        [
          0,
          "gd"
        ]
      ],
      [
        [
          1,
          "gh"
        ],
        [
          1,
          "hg"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "hr"
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cr"
        ],
        [
          0,
          "hs"
        ],
        [
          0,
          "cs"
        ],
        [
          0,
          "hf"
        ],
        [
          0,
          "gf"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          
        ],
        [
          1,
          "hu"
        ],
        [
          1,
          "hy"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hz"
        ],
        [
          0,
          "ht"
        ],
        [
          
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "am",
    "an",
    "bl",
    "ci",
    "cl",
    "cm",
    "co",
    "cp",
    "cr",
    "cs",
    "ct",
    "dh",
    "dp",
    "dq",
    "dr",
    "ds",
    "dt",
    "du",
    "dv",
    "fh",
    "fx",
    "fy",
    "fz",
    "ga",
    "gb",
    "gc",
    "gd",
    "ge",
    "gf",
    "gh",
    "gj",
    "gk",
    "gl",
    "gm",
    "gn",
    "go",
    "hb",
    "hf",
    "hg",
    "hh",
    "hi",
    "hj",
    "hk",
    "hl",
    "hm",
    "hn",
    "ho",
    "hp",
    "hq",
    "hr",
    "hs",
    "ht",
    "hu",
    "hv",
    "hw",
    "hx",
    "hy",
    "hz",
    "ia",
    "ic",
    "id",
    "ie",
    "ig",
    "lf"
  ],
  "name": "大大将棋",
  "nari": {
    "aa": null,
    "ab": null,
    "ad": null,
    "ae": null,
    "af": null,
    "ag": null,
    "ah": null,
    "am": null,
    "an": null,
    "bl": "ie",
    "ci": null,
    "cl": null,
    "cm": null,
    "co": "hb",
    "cp": "hl",
    "cr": null,
    "cs": null,
    "ct": null,
    "dp": null,
    "dq": null,
    "dr": null,
    "ds": null,
    "dt": "am",
    "du": null,
    "dv": "an",
    "fh": "fz",
    "fx": null,
    "fy": null,
    "fz": null,
    "ga": null,
    "gb": null,
    "gc": null,
    "gd": null,
    "ge": null,
    "gf": null,
    "gh": null,
    "gj": "hv",
    "gk": "ga",
    "gl": "gb",
    "gm": "ic",
    "gn": "id",
    "go": "ig",
    "hf": "gf",
    "hg": "gh",
    "hh": null,
    "hi": "ct",
    "hj": "ge",
    "hk": "gd",
    "hl": null,
    "hm": null,
    "hn": "dh",
    "ho": "hr",
    "hp": "lf",
    "hq": "hs",
    "hr": null,
    "hs": null,
    "ht": null,
    "hu": null,
    "hv": null,
    "hw": null,
    "hx": null,
    "hy": null,
    "hz": null,
    "ia": null
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000025")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000040")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000042")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000043")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000045")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000046")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000047")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000055")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000060")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000061")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000062")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000063")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000089")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000099")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00009a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00009b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00009c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00009d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00009e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00009f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a5")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000aa")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000b7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000bb")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000bc")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000bd")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000be")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000bf")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c2")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c5")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000ca")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000cb")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000cc")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000cd")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000ce")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000cf")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d2")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000039")
    }
  ],
  "size": [
    17,
    17
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "NoUse": true
    },
    "Promotion": {
      "Capture": {
        "must": true
      }
    }
  },
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 61,
  "abstract": "19x19。50種類の駒がある。",
  "img": {
    "height": 34,
    "width": 30
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          
        ],
        [
          1,
          "it"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "it"
        ],
        [
          
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ik"
        ],
        [
          
        ],
        [
          1,
          "gm"
        ],
        [
          
        ],
        [
          1,
          "hz"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hy"
        ],
        [
          
        ],
        [
          0,
          "gm"
        ],
        [
          
        ],
        [
          0,
          "ik"
        ]
      ],
      [
        [
          1,
          "dq"
        ],
        [
          1,
          "dt"
        ],
        [
          
        ],
        [
          1,
          "ac"
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cr"
        ],
        [
          0,
          "ac"
        ],
        [
          
        ],
        [
          0,
          "dt"
        ],
        [
          0,
          "dq"
        ]
      ],
      [
        [
          1,
          "ij"
        ],
        [
          
        ],
        [
          1,
          "ds"
        ],
        [
          
        ],
        [
          1,
          "iw"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "iw"
        ],
        [
          
        ],
        [
          0,
          "ds"
        ],
        [
          
        ],
        [
          0,
          "ij"
        ]
      ],
      [
        [
          1,
          "dp"
        ],
        [
          1,
          "in"
        ],
        [
          
        ],
        [
          1,
          "du"
        ],
        [
          1,
          "cs"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cs"
        ],
        [
          0,
          "du"
        ],
        [
          
        ],
        [
          0,
          "io"
        ],
        [
          0,
          "dp"
        ]
      ],
      [
        [
          1,
          "ci"
        ],
        [
          
        ],
        [
          1,
          "ip"
        ],
        [
          
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          
        ],
        [
          0,
          "ip"
        ],
        [
          
        ],
        [
          0,
          "ci"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          1,
          "im"
        ],
        [
          
        ],
        [
          1,
          "dv"
        ],
        [
          1,
          "am"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "am"
        ],
        [
          0,
          "dv"
        ],
        [
          
        ],
        [
          0,
          "il"
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "cl"
        ],
        [
          1,
          "dr"
        ],
        [
          1,
          "is"
        ],
        [
          1,
          "an"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "an"
        ],
        [
          0,
          "gd"
        ],
        [
          0,
          "dr"
        ],
        [
          0,
          "cl"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ii"
        ],
        [
          1,
          "cn"
        ],
        [
          1,
          "co"
        ],
        [
          1,
          "ir"
        ],
        [
          1,
          "iu"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "gh"
        ],
        [
          0,
          "iq"
        ],
        [
          0,
          "cp"
        ],
        [
          0,
          "cn"
        ],
        [
          0,
          "ih"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          1,
          "cf"
        ],
        [
          1,
          "bl"
        ],
        [
          1,
          "go"
        ],
        [
          1,
          "ct"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ct"
        ],
        [
          0,
          "go"
        ],
        [
          0,
          "bl"
        ],
        [
          0,
          "cf"
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ih"
        ],
        [
          1,
          "cn"
        ],
        [
          1,
          "cp"
        ],
        [
          1,
          "iq"
        ],
        [
          1,
          "gh"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "iu"
        ],
        [
          0,
          "ir"
        ],
        [
          0,
          "co"
        ],
        [
          0,
          "cn"
        ],
        [
          0,
          "ii"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "cl"
        ],
        [
          1,
          "dr"
        ],
        [
          1,
          "gd"
        ],
        [
          1,
          "an"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "an"
        ],
        [
          0,
          "is"
        ],
        [
          0,
          "dr"
        ],
        [
          0,
          "cl"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          1,
          "il"
        ],
        [
          
        ],
        [
          1,
          "dv"
        ],
        [
          1,
          "am"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "am"
        ],
        [
          0,
          "dv"
        ],
        [
          
        ],
        [
          0,
          "im"
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ci"
        ],
        [
          
        ],
        [
          1,
          "ip"
        ],
        [
          
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          
        ],
        [
          0,
          "ip"
        ],
        [
          
        ],
        [
          0,
          "ci"
        ]
      ],
      [
        [
          1,
          "dp"
        ],
        [
          1,
          "io"
        ],
        [
          
        ],
        [
          1,
          "du"
        ],
        [
          1,
          "cs"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cs"
        ],
        [
          0,
          "du"
        ],
        [
          
        ],
        [
          0,
          "in"
        ],
        [
          0,
          "dp"
        ]
      ],
      [
        [
          1,
          "ij"
        ],
        [
          
        ],
        [
          1,
          "ds"
        ],
        [
          
        ],
        [
          1,
          "iw"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "iw"
        ],
        [
          
        ],
        [
          0,
          "ds"
        ],
        [
          
        ],
        [
          0,
          "ij"
        ]
      ],
      [
        [
          1,
          "dq"
        ],
        [
          1,
          "dt"
        ],
        [
          
        ],
        [
          1,
          "ac"
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cr"
        ],
        [
          0,
          "ac"
        ],
        [
          
        ],
        [
          0,
          "dt"
        ],
        [
          0,
          "dq"
        ]
      ],
      [
        [
          1,
          "ik"
        ],
        [
          
        ],
        [
          1,
          "gm"
        ],
        [
          
        ],
        [
          1,
          "hy"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hz"
        ],
        [
          
        ],
        [
          0,
          "gm"
        ],
        [
          
        ],
        [
          0,
          "ik"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          
        ],
        [
          1,
          "it"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "it"
        ],
        [
          
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "am",
    "an",
    "bl",
    "cf",
    "ci",
    "cl",
    "cm",
    "cn",
    "co",
    "cp",
    "cq",
    "cr",
    "cs",
    "ct",
    "cx",
    "do",
    "dp",
    "dq",
    "dr",
    "ds",
    "dt",
    "du",
    "dv",
    "gd",
    "gh",
    "gm",
    "go",
    "hb",
    "hl",
    "hy",
    "hz",
    "id",
    "ie",
    "ih",
    "ii",
    "ij",
    "ik",
    "il",
    "im",
    "in",
    "io",
    "ip",
    "iq",
    "ir",
    "is",
    "it",
    "iu",
    "iw",
    "ix",
    "iy",
    "iz",
    "jb",
    "jo",
    "js",
    "jt",
    "ju",
    "jv",
    "jw",
    "jx",
    "jy",
    "jz",
    "ka",
    "kb",
    "kc",
    "kd",
    "kf",
    "kg",
    "kh"
  ],
  "name": "摩訶大大将棋",
  "nari": {
    "aa": "do",
    "ab": "do",
    "ac": "do",
    "ad": "ka",
    "ae": "jz",
    "af": "do",
    "ag": "do",
    "ah": "ix",
    "am": null,
    "an": null,
    "bl": "ie",
    "cf": "iy",
    "ci": "kb",
    "cl": "ju",
    "cm": "do",
    "cn": "jt",
    "co": "hb",
    "cp": "hl",
    "cq": "kh",
    "cr": "do",
    "cs": "do",
    "ct": null,
    "dp": "kc",
    "dq": "do",
    "dr": "jx",
    "ds": "cx",
    "dt": "kg",
    "du": "do",
    "dv": "do",
    "gd": "do",
    "gh": "do",
    "gm": "js",
    "go": "do",
    "hy": "do",
    "hz": "do",
    "ih": "iz",
    "ii": "jb",
    "ij": "kd",
    "ik": "kf",
    "il": "jw",
    "im": "jv",
    "in": "jo",
    "io": "id",
    "ip": "jy",
    "iq": "do",
    "ir": "do",
    "is": "do",
    "it": "do",
    "iu": "do",
    "iw": "do"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000025")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000039")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000040")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000041")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000042")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000043")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000044")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000045")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000046")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000047")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000060")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000061")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000062")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000063")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00009f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000aa")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000b7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000ce")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000cf")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000da")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000db")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000dc")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000dd")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000de")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000df")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e2")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbba4325a2633e0000eb")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbba4325a2633e0000f8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000012")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000013")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000014")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000015")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000016")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000017")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000018")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000019")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900001a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900001b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900001c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900001d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900001f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000020")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000021")
    }
  ],
  "size": [
    19,
    19
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "NoUse": true
    },
    "Promotion": {
      "Capture": {
        "must": true
      }
    }
  },
  "winkoma": [
    "ah",
    "iy"
  ]
});
db.getCollection("rule").insert({
  "_id": 62,
  "abstract": "駒の隣でその駒が動ける場所に駒が１つあった場合、飛び越えて進むことが出来る。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "iterator": {
    "BanScan": {
      "Diamond": [
        
      ]
    }
  },
  "name": "ダイヤモンド将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 63,
  "abstract": "25x25。93種類の駒がある。",
  "img": {
    "height": 29,
    "width": 26
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          1,
          "gc"
        ],
        [
          1,
          "mo"
        ],
        [
          1,
          "hz"
        ],
        [
          1,
          "ia"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ia"
        ],
        [
          0,
          "hy"
        ],
        [
          0,
          "mo"
        ],
        [
          0,
          "gc"
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "mq"
        ],
        [
          1,
          "mh"
        ],
        [
          1,
          "cu"
        ],
        [
          1,
          "fh"
        ],
        [
          1,
          "ht"
        ],
        [
          1,
          "hi"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hi"
        ],
        [
          0,
          "mp"
        ],
        [
          0,
          "fh"
        ],
        [
          0,
          "cu"
        ],
        [
          0,
          "mh"
        ],
        [
          0,
          "hu"
        ]
      ],
      [
        [
          1,
          "cv"
        ],
        [
          1,
          "db"
        ],
        [
          1,
          "mk"
        ],
        [
          1,
          "cl"
        ],
        [
          1,
          "hm"
        ],
        [
          1,
          "hj"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hj"
        ],
        [
          0,
          "hm"
        ],
        [
          0,
          "cl"
        ],
        [
          0,
          "mk"
        ],
        [
          0,
          "db"
        ],
        [
          0,
          "cv"
        ]
      ],
      [
        [
          1,
          "dv"
        ],
        [
          1,
          "ac"
        ],
        [
          1,
          "du"
        ],
        [
          1,
          "hq"
        ],
        [
          1,
          "ik"
        ],
        [
          1,
          "it"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "it"
        ],
        [
          0,
          "ik"
        ],
        [
          0,
          "hq"
        ],
        [
          0,
          "du"
        ],
        [
          0,
          "ac"
        ],
        [
          0,
          "dv"
        ]
      ],
      [
        [
          1,
          "gf"
        ],
        [
          1,
          "hg"
        ],
        [
          1,
          "dt"
        ],
        [
          1,
          "hn"
        ],
        [
          1,
          "dq"
        ],
        [
          1,
          "cy"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cy"
        ],
        [
          0,
          "dq"
        ],
        [
          0,
          "ho"
        ],
        [
          0,
          "dt"
        ],
        [
          0,
          "hg"
        ],
        [
          0,
          "gf"
        ]
      ],
      [
        [
          1,
          "ge"
        ],
        [
          1,
          "fz"
        ],
        [
          1,
          "ip"
        ],
        [
          1,
          "in"
        ],
        [
          1,
          "ij"
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cr"
        ],
        [
          0,
          "ij"
        ],
        [
          0,
          "in"
        ],
        [
          0,
          "ip"
        ],
        [
          0,
          "fz"
        ],
        [
          0,
          "ge"
        ]
      ],
      [
        [
          1,
          "ag"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "mj"
        ],
        [
          1,
          "cz"
        ],
        [
          1,
          "dp"
        ],
        [
          1,
          "cs"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cs"
        ],
        [
          0,
          "dp"
        ],
        [
          0,
          "cz"
        ],
        [
          0,
          "mj"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ag"
        ]
      ],
      [
        [
          1,
          "am"
        ],
        [
          1,
          "mg"
        ],
        [
          1,
          "mi"
        ],
        [
          1,
          "io"
        ],
        [
          1,
          "ci"
        ],
        [
          1,
          "hx"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hx"
        ],
        [
          0,
          "ci"
        ],
        [
          0,
          "io"
        ],
        [
          0,
          "mi"
        ],
        [
          0,
          "mg"
        ],
        [
          0,
          "am"
        ]
      ],
      [
        [
          1,
          "an"
        ],
        [
          1,
          "hr"
        ],
        [
          1,
          "gn"
        ],
        [
          1,
          "mr"
        ],
        [
          1,
          "gm"
        ],
        [
          1,
          "hv"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hv"
        ],
        [
          0,
          "gm"
        ],
        [
          0,
          "gk"
        ],
        [
          0,
          "gn"
        ],
        [
          0,
          "hr"
        ],
        [
          0,
          "an"
        ]
      ],
      [
        [
          1,
          "ct"
        ],
        [
          1,
          "ga"
        ],
        [
          1,
          "cn"
        ],
        [
          1,
          "ml"
        ],
        [
          1,
          "im"
        ],
        [
          1,
          "gl"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "gl"
        ],
        [
          0,
          "im"
        ],
        [
          0,
          "ml"
        ],
        [
          0,
          "cn"
        ],
        [
          0,
          "ga"
        ],
        [
          0,
          "ct"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "ad"
        ],
        [
          1,
          "is"
        ],
        [
          1,
          "hh"
        ],
        [
          1,
          "il"
        ],
        [
          1,
          "ds"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ds"
        ],
        [
          0,
          "il"
        ],
        [
          0,
          "hl"
        ],
        [
          0,
          "gd"
        ],
        [
          0,
          "ad"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ii"
        ],
        [
          1,
          "fy"
        ],
        [
          1,
          "ir"
        ],
        [
          1,
          "co"
        ],
        [
          1,
          "iu"
        ],
        [
          1,
          "dr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "dr"
        ],
        [
          0,
          "gh"
        ],
        [
          0,
          "cp"
        ],
        [
          0,
          "iq"
        ],
        [
          0,
          "fx"
        ],
        [
          0,
          "ih"
        ]
      ],
      [
        [
          1,
          "ix"
        ],
        [
          1,
          "cg"
        ],
        [
          1,
          "gj"
        ],
        [
          1,
          "bl"
        ],
        [
          1,
          "cf"
        ],
        [
          1,
          "go"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "go"
        ],
        [
          0,
          "cf"
        ],
        [
          0,
          "bl"
        ],
        [
          0,
          "gj"
        ],
        [
          0,
          "cg"
        ],
        [
          0,
          "ix"
        ]
      ],
      [
        [
          1,
          "ih"
        ],
        [
          1,
          "fx"
        ],
        [
          1,
          "iq"
        ],
        [
          1,
          "cp"
        ],
        [
          1,
          "gh"
        ],
        [
          1,
          "dr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "dr"
        ],
        [
          0,
          "iu"
        ],
        [
          0,
          "co"
        ],
        [
          0,
          "ir"
        ],
        [
          0,
          "fy"
        ],
        [
          0,
          "ii"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "ad"
        ],
        [
          1,
          "gd"
        ],
        [
          1,
          "hl"
        ],
        [
          1,
          "il"
        ],
        [
          1,
          "ds"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ds"
        ],
        [
          0,
          "il"
        ],
        [
          0,
          "hh"
        ],
        [
          0,
          "is"
        ],
        [
          0,
          "ad"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ct"
        ],
        [
          1,
          "ga"
        ],
        [
          1,
          "cn"
        ],
        [
          1,
          "ml"
        ],
        [
          1,
          "im"
        ],
        [
          1,
          "gl"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "gl"
        ],
        [
          0,
          "im"
        ],
        [
          0,
          "ml"
        ],
        [
          0,
          "cn"
        ],
        [
          0,
          "ga"
        ],
        [
          0,
          "ct"
        ]
      ],
      [
        [
          1,
          "an"
        ],
        [
          1,
          "hr"
        ],
        [
          1,
          "gn"
        ],
        [
          1,
          "gk"
        ],
        [
          1,
          "gm"
        ],
        [
          1,
          "hv"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hv"
        ],
        [
          0,
          "gm"
        ],
        [
          0,
          "mr"
        ],
        [
          0,
          "gn"
        ],
        [
          0,
          "hr"
        ],
        [
          0,
          "an"
        ]
      ],
      [
        [
          1,
          "am"
        ],
        [
          1,
          "mg"
        ],
        [
          1,
          "mi"
        ],
        [
          1,
          "io"
        ],
        [
          1,
          "ci"
        ],
        [
          1,
          "hx"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hx"
        ],
        [
          0,
          "ci"
        ],
        [
          0,
          "io"
        ],
        [
          0,
          "mi"
        ],
        [
          0,
          "mg"
        ],
        [
          0,
          "am"
        ]
      ],
      [
        [
          1,
          "ag"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "mj"
        ],
        [
          1,
          "cz"
        ],
        [
          1,
          "dp"
        ],
        [
          1,
          "cs"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cs"
        ],
        [
          0,
          "dp"
        ],
        [
          0,
          "cz"
        ],
        [
          0,
          "mj"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ag"
        ]
      ],
      [
        [
          1,
          "ge"
        ],
        [
          1,
          "fz"
        ],
        [
          1,
          "ip"
        ],
        [
          1,
          "in"
        ],
        [
          1,
          "ij"
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cr"
        ],
        [
          0,
          "ij"
        ],
        [
          0,
          "in"
        ],
        [
          0,
          "ip"
        ],
        [
          0,
          "fz"
        ],
        [
          0,
          "ge"
        ]
      ],
      [
        [
          1,
          "gf"
        ],
        [
          1,
          "hg"
        ],
        [
          1,
          "dt"
        ],
        [
          1,
          "ho"
        ],
        [
          1,
          "dq"
        ],
        [
          1,
          "cy"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cy"
        ],
        [
          0,
          "dq"
        ],
        [
          0,
          "hn"
        ],
        [
          0,
          "dt"
        ],
        [
          0,
          "hg"
        ],
        [
          0,
          "gf"
        ]
      ],
      [
        [
          1,
          "dv"
        ],
        [
          1,
          "ac"
        ],
        [
          1,
          "du"
        ],
        [
          1,
          "hp"
        ],
        [
          1,
          "ik"
        ],
        [
          1,
          "it"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "it"
        ],
        [
          0,
          "ik"
        ],
        [
          0,
          "hp"
        ],
        [
          0,
          "du"
        ],
        [
          0,
          "ac"
        ],
        [
          0,
          "dv"
        ]
      ],
      [
        [
          1,
          "cv"
        ],
        [
          1,
          "db"
        ],
        [
          1,
          "mk"
        ],
        [
          1,
          "cl"
        ],
        [
          1,
          "hm"
        ],
        [
          1,
          "hj"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hj"
        ],
        [
          0,
          "hm"
        ],
        [
          0,
          "cl"
        ],
        [
          0,
          "mk"
        ],
        [
          0,
          "db"
        ],
        [
          0,
          "cv"
        ]
      ],
      [
        [
          1,
          "hu"
        ],
        [
          1,
          "mh"
        ],
        [
          1,
          "cu"
        ],
        [
          1,
          "fh"
        ],
        [
          1,
          "mp"
        ],
        [
          1,
          "hi"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "hi"
        ],
        [
          0,
          "ht"
        ],
        [
          0,
          "fh"
        ],
        [
          0,
          "cu"
        ],
        [
          0,
          "mh"
        ],
        [
          0,
          "mq"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          1,
          "gc"
        ],
        [
          1,
          "mo"
        ],
        [
          1,
          "hy"
        ],
        [
          1,
          "ia"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ia"
        ],
        [
          0,
          "hz"
        ],
        [
          0,
          "mo"
        ],
        [
          0,
          "gc"
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "am",
    "an",
    "bl",
    "cf",
    "cg",
    "ci",
    "cl",
    "cm",
    "cn",
    "co",
    "cp",
    "cq",
    "cr",
    "cs",
    "ct",
    "cu",
    "cv",
    "cx",
    "cy",
    "cz",
    "db",
    "dh",
    "do",
    "dp",
    "dq",
    "dr",
    "ds",
    "dt",
    "du",
    "dv",
    "fh",
    "fx",
    "fy",
    "fz",
    "ga",
    "gb",
    "gc",
    "gd",
    "ge",
    "gf",
    "gh",
    "gj",
    "gk",
    "gl",
    "gm",
    "gn",
    "go",
    "hb",
    "hc",
    "he",
    "hg",
    "hh",
    "hi",
    "hj",
    "hl",
    "hm",
    "hn",
    "ho",
    "hp",
    "hq",
    "hr",
    "ht",
    "hu",
    "hv",
    "hx",
    "hy",
    "hz",
    "ia",
    "id",
    "ie",
    "ig",
    "ih",
    "ii",
    "ij",
    "ik",
    "il",
    "im",
    "in",
    "io",
    "ip",
    "iq",
    "ir",
    "is",
    "it",
    "iu",
    "ix",
    "jb",
    "jo",
    "jp",
    "jq",
    "jr",
    "js",
    "jt",
    "ju",
    "jv",
    "jw",
    "jx",
    "jy",
    "jz",
    "ka",
    "kb",
    "kc",
    "kd",
    "ke",
    "kf",
    "kg",
    "kh",
    "lf",
    "mg",
    "mh",
    "mi",
    "mj",
    "mk",
    "ml",
    "mo",
    "mp",
    "mq",
    "mr"
  ],
  "name": "泰将棋",
  "nari": {
    "aa": "do",
    "ab": "do",
    "ac": "do",
    "ad": "ka",
    "ae": "jz",
    "af": "do",
    "ag": "do",
    "am": null,
    "an": null,
    "bl": "ie",
    "cf": "cg",
    "cg": null,
    "ci": "kb",
    "cl": "ju",
    "cm": "do",
    "cn": "jt",
    "co": "hb",
    "cp": "he",
    "cq": "kh",
    "cr": "do",
    "cs": "do",
    "ct": null,
    "cu": "do",
    "cv": "do",
    "cy": "do",
    "cz": "do",
    "db": "do",
    "dp": "kc",
    "dq": "ke",
    "dr": "jx",
    "ds": "cx",
    "dt": "kg",
    "du": "do",
    "dv": "do",
    "fh": "fz",
    "fx": "do",
    "fy": "do",
    "fz": "do",
    "ga": "do",
    "gc": "do",
    "gd": "do",
    "ge": "do",
    "gf": "do",
    "gh": "do",
    "gj": "jr",
    "gk": "jp",
    "gl": "gb",
    "gm": "js",
    "gn": "id",
    "go": "ig",
    "hg": "do",
    "hh": "do",
    "hi": "ct",
    "hj": "ge",
    "hl": "do",
    "hm": "do",
    "hn": "dh",
    "ho": "jq",
    "hp": "lf",
    "hq": "do",
    "hr": "do",
    "ht": "do",
    "hu": "do",
    "hv": "do",
    "hx": "do",
    "hy": "do",
    "hz": "do",
    "ia": "do",
    "ih": "jz",
    "ii": "jb",
    "ij": "kd",
    "ik": "kf",
    "il": "jw",
    "im": "jv",
    "in": "jo",
    "io": "id",
    "ip": "jy",
    "iq": "do",
    "ir": "do",
    "is": "do",
    "it": "do",
    "iu": "do",
    "ix": null,
    "mg": "do",
    "mh": "do",
    "mi": "do",
    "mj": "do",
    "mk": "do",
    "ml": "do",
    "mo": "do",
    "mp": "do",
    "mq": "do",
    "mr": "hc"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000025")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000039")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000040")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000041")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000042")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000043")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000044")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000045")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000046")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000047")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000048")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000049")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000055")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000060")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000061")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000062")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000063")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000089")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000099")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00009a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00009b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00009c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00009d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00009e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00009f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a5")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000aa")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000b7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000b8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000ba")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000bc")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000bd")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000be")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000bf")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c2")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c5")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000ca")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000cb")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000cd")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000cf")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000da")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000db")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000dc")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000dd")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000de")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000df")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e2")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbba4325a2633e0000eb")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbba4325a2633e0000f8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbba4325a2633e0000f9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbba4325a2633e0000fa")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000011")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000012")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000013")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000014")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000015")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000016")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000017")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000018")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000019")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900001a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900001b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900001c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900001d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900001e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900001f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000020")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000021")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000039")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000054")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000055")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000056")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000057")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000058")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000059")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900005c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900005d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900005e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900005f")
    }
  ],
  "size": [
    25,
    25
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "NoUse": true
    },
    "Promotion": {
      "Capture": {
        "must": true
      }
    }
  },
  "winkoma": [
    "ix",
    "cg"
  ]
});
db.getCollection("rule").insert({
  "_id": 64,
  "abstract": "36x36。209種類の駒がある。",
  "img": {
    "height": 29,
    "width": 26
  },
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          1,
          "ot"
        ],
        [
          1,
          "pq"
        ],
        [
          1,
          "qc"
        ],
        [
          1,
          "qm"
        ],
        [
          1,
          "qu"
        ],
        [
          1,
          "qy"
        ],
        [
          1,
          "fb"
        ],
        [
          1,
          "sk"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sv"
        ],
        [
          0,
          "fb"
        ],
        [
          0,
          "qy"
        ],
        [
          0,
          "qu"
        ],
        [
          0,
          "qm"
        ],
        [
          0,
          "qc"
        ],
        [
          0,
          "pq"
        ],
        [
          0,
          "ot"
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "mq"
        ],
        [
          1,
          "wj"
        ],
        [
          1,
          "vy"
        ],
        [
          1,
          "pp"
        ],
        [
          1,
          "vg"
        ],
        [
          1,
          "cu"
        ],
        [
          1,
          "qs"
        ],
        [
          1,
          "tb"
        ],
        [
          1,
          "fj"
        ],
        [
          1,
          "sj"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sj"
        ],
        [
          0,
          "fj"
        ],
        [
          0,
          "ue"
        ],
        [
          0,
          "qs"
        ],
        [
          0,
          "cu"
        ],
        [
          0,
          "vg"
        ],
        [
          0,
          "pp"
        ],
        [
          0,
          "vy"
        ],
        [
          0,
          "wp"
        ],
        [
          0,
          "xc"
        ]
      ],
      [
        [
          1,
          "wr"
        ],
        [
          1,
          "nw"
        ],
        [
          1,
          "or"
        ],
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "ib"
        ],
        [
          1,
          "qq"
        ],
        [
          1,
          "td"
        ],
        [
          1,
          "fi"
        ],
        [
          1,
          "cs"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cs"
        ],
        [
          0,
          "fi"
        ],
        [
          0,
          "td"
        ],
        [
          0,
          "qq"
        ],
        [
          0,
          "ib"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ],
        [
          0,
          "or"
        ],
        [
          0,
          "nw"
        ],
        [
          0,
          "wr"
        ]
      ],
      [
        [
          1,
          "cv"
        ],
        [
          1,
          "nv"
        ],
        [
          1,
          "oq"
        ],
        [
          1,
          "pn"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "ug"
        ],
        [
          1,
          "qw"
        ],
        [
          1,
          "rq"
        ],
        [
          1,
          "cy"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cy"
        ],
        [
          0,
          "rq"
        ],
        [
          0,
          "qw"
        ],
        [
          0,
          "ug"
        ],
        [
          0,
          "cr"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "pn"
        ],
        [
          0,
          "oq"
        ],
        [
          0,
          "nv"
        ],
        [
          0,
          "cv"
        ]
      ],
      [
        [
          1,
          "wu"
        ],
        [
          1,
          "nt"
        ],
        [
          1,
          "wa"
        ],
        [
          1,
          "pl"
        ],
        [
          1,
          "qb"
        ],
        [
          1,
          "va"
        ],
        [
          1,
          "uh"
        ],
        [
          1,
          "dz"
        ],
        [
          1,
          "ro"
        ],
        [
          1,
          "sh"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sh"
        ],
        [
          0,
          "ro"
        ],
        [
          0,
          "dz"
        ],
        [
          0,
          "uh"
        ],
        [
          0,
          "va"
        ],
        [
          0,
          "qb"
        ],
        [
          0,
          "pl"
        ],
        [
          0,
          "wa"
        ],
        [
          0,
          "nt"
        ],
        [
          0,
          "wu"
        ]
      ],
      [
        [
          1,
          "nc"
        ],
        [
          1,
          "nr"
        ],
        [
          1,
          "wc"
        ],
        [
          1,
          "pj"
        ],
        [
          1,
          "qa"
        ],
        [
          1,
          "fh"
        ],
        [
          1,
          "hx"
        ],
        [
          1,
          "dy"
        ],
        [
          1,
          "rm"
        ],
        [
          1,
          "sf"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "xf"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "xf"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sf"
        ],
        [
          0,
          "rm"
        ],
        [
          0,
          "dy"
        ],
        [
          0,
          "hx"
        ],
        [
          0,
          "fh"
        ],
        [
          0,
          "qa"
        ],
        [
          0,
          "pj"
        ],
        [
          0,
          "wc"
        ],
        [
          0,
          "nr"
        ],
        [
          0,
          "nc"
        ]
      ],
      [
        [
          1,
          "wh"
        ],
        [
          1,
          "np"
        ],
        [
          1,
          "oo"
        ],
        [
          1,
          "ph"
        ],
        [
          1,
          "py"
        ],
        [
          1,
          "cl"
        ],
        [
          1,
          "uj"
        ],
        [
          1,
          "dt"
        ],
        [
          1,
          "sy"
        ],
        [
          1,
          "se"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "se"
        ],
        [
          0,
          "sy"
        ],
        [
          0,
          "dt"
        ],
        [
          0,
          "uj"
        ],
        [
          0,
          "cl"
        ],
        [
          0,
          "py"
        ],
        [
          0,
          "ph"
        ],
        [
          0,
          "om"
        ],
        [
          0,
          "np"
        ],
        [
          0,
          "wh"
        ]
      ],
      [
        [
          1,
          "mz"
        ],
        [
          1,
          "nn"
        ],
        [
          1,
          "ok"
        ],
        [
          1,
          "pf"
        ],
        [
          1,
          "px"
        ],
        [
          1,
          "vd"
        ],
        [
          1,
          "dr"
        ],
        [
          1,
          "ei"
        ],
        [
          1,
          "rk"
        ],
        [
          1,
          "sc"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sc"
        ],
        [
          0,
          "rk"
        ],
        [
          0,
          "ei"
        ],
        [
          0,
          "dr"
        ],
        [
          0,
          "vd"
        ],
        [
          0,
          "px"
        ],
        [
          0,
          "pf"
        ],
        [
          0,
          "oi"
        ],
        [
          0,
          "nn"
        ],
        [
          0,
          "mz"
        ]
      ],
      [
        [
          1,
          "mx"
        ],
        [
          1,
          "nm"
        ],
        [
          1,
          "og"
        ],
        [
          1,
          "pd"
        ],
        [
          1,
          "vi"
        ],
        [
          1,
          "ve"
        ],
        [
          1,
          "ul"
        ],
        [
          1,
          "gn"
        ],
        [
          1,
          "hm"
        ],
        [
          1,
          "am"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "am"
        ],
        [
          0,
          "hm"
        ],
        [
          0,
          "gn"
        ],
        [
          0,
          "ul"
        ],
        [
          0,
          "ve"
        ],
        [
          0,
          "vi"
        ],
        [
          0,
          "pd"
        ],
        [
          0,
          "og"
        ],
        [
          0,
          "nm"
        ],
        [
          0,
          "mx"
        ]
      ],
      [
        [
          1,
          "wf"
        ],
        [
          1,
          "nl"
        ],
        [
          1,
          "oe"
        ],
        [
          1,
          "pb"
        ],
        [
          1,
          "pv"
        ],
        [
          1,
          "hg"
        ],
        [
          1,
          "ea"
        ],
        [
          1,
          "cn"
        ],
        [
          1,
          "ri"
        ],
        [
          1,
          "an"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "an"
        ],
        [
          0,
          "ri"
        ],
        [
          0,
          "cn"
        ],
        [
          0,
          "ea"
        ],
        [
          0,
          "hg"
        ],
        [
          0,
          "pv"
        ],
        [
          0,
          "pb"
        ],
        [
          0,
          "oe"
        ],
        [
          0,
          "nl"
        ],
        [
          0,
          "wf"
        ]
      ],
      [
        [
          1,
          "mv"
        ],
        [
          1,
          "nj"
        ],
        [
          1,
          "oc"
        ],
        [
          1,
          "mj"
        ],
        [
          1,
          "pu"
        ],
        [
          1,
          "ed"
        ],
        [
          1,
          "io"
        ],
        [
          1,
          "eg"
        ],
        [
          1,
          "ik"
        ],
        [
          1,
          "sa"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sa"
        ],
        [
          0,
          "ik"
        ],
        [
          0,
          "eg"
        ],
        [
          0,
          "io"
        ],
        [
          0,
          "ed"
        ],
        [
          0,
          "pu"
        ],
        [
          0,
          "mj"
        ],
        [
          0,
          "oc"
        ],
        [
          0,
          "nj"
        ],
        [
          0,
          "mv"
        ]
      ],
      [
        [
          1,
          "mu"
        ],
        [
          1,
          "nh"
        ],
        [
          1,
          "we"
        ],
        [
          1,
          "mi"
        ],
        [
          1,
          "ps"
        ],
        [
          1,
          "ee"
        ],
        [
          1,
          "in"
        ],
        [
          1,
          "iw"
        ],
        [
          1,
          "rg"
        ],
        [
          1,
          "sn"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sn"
        ],
        [
          0,
          "rg"
        ],
        [
          0,
          "iw"
        ],
        [
          0,
          "in"
        ],
        [
          0,
          "ee"
        ],
        [
          0,
          "ps"
        ],
        [
          0,
          "mi"
        ],
        [
          0,
          "we"
        ],
        [
          0,
          "nh"
        ],
        [
          0,
          "ni"
        ]
      ],
      [
        [
          1,
          "ww"
        ],
        [
          1,
          "ng"
        ],
        [
          1,
          "wg"
        ],
        [
          1,
          "bl"
        ],
        [
          1,
          "vj"
        ],
        [
          1,
          "ef"
        ],
        [
          1,
          "uq"
        ],
        [
          1,
          "tg"
        ],
        [
          1,
          "dq"
        ],
        [
          1,
          "sp"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sp"
        ],
        [
          0,
          "dq"
        ],
        [
          0,
          "tg"
        ],
        [
          0,
          "uw"
        ],
        [
          0,
          "ef"
        ],
        [
          0,
          "vj"
        ],
        [
          0,
          "bl"
        ],
        [
          0,
          "wg"
        ],
        [
          0,
          "ng"
        ],
        [
          0,
          "ww"
        ]
      ],
      [
        [
          1,
          "ct"
        ],
        [
          1,
          "ne"
        ],
        [
          1,
          "ml"
        ],
        [
          1,
          "oz"
        ],
        [
          1,
          "vl"
        ],
        [
          1,
          "qk"
        ],
        [
          1,
          "ur"
        ],
        [
          1,
          "th"
        ],
        [
          1,
          "re"
        ],
        [
          1,
          "ry"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ry"
        ],
        [
          0,
          "re"
        ],
        [
          0,
          "th"
        ],
        [
          0,
          "uu"
        ],
        [
          0,
          "qk"
        ],
        [
          0,
          "vl"
        ],
        [
          0,
          "oz"
        ],
        [
          0,
          "ml"
        ],
        [
          0,
          "ne"
        ],
        [
          0,
          "ct"
        ]
      ],
      [
        [
          1,
          "ms"
        ],
        [
          1,
          "is"
        ],
        [
          1,
          "ob"
        ],
        [
          1,
          "oy"
        ],
        [
          1,
          "vn"
        ],
        [
          1,
          "qi"
        ],
        [
          1,
          "eb"
        ],
        [
          1,
          "tj"
        ],
        [
          1,
          "ij"
        ],
        [
          1,
          "rw"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "xf"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "xf"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "rw"
        ],
        [
          0,
          "ij"
        ],
        [
          0,
          "tj"
        ],
        [
          0,
          "eb"
        ],
        [
          0,
          "qi"
        ],
        [
          0,
          "vn"
        ],
        [
          0,
          "oy"
        ],
        [
          0,
          "ob"
        ],
        [
          0,
          "wo"
        ],
        [
          0,
          "ms"
        ]
      ],
      [
        [
          1,
          "wx"
        ],
        [
          1,
          "wm"
        ],
        [
          1,
          "oa"
        ],
        [
          1,
          "ox"
        ],
        [
          1,
          "vp"
        ],
        [
          1,
          "vf"
        ],
        [
          1,
          "ec"
        ],
        [
          1,
          "im"
        ],
        [
          1,
          "rc"
        ],
        [
          1,
          "sr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sr"
        ],
        [
          0,
          "rc"
        ],
        [
          0,
          "im"
        ],
        [
          0,
          "ec"
        ],
        [
          0,
          "cp"
        ],
        [
          0,
          "vp"
        ],
        [
          0,
          "ox"
        ],
        [
          0,
          "oa"
        ],
        [
          0,
          "wn"
        ],
        [
          0,
          "xa"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "ad"
        ],
        [
          1,
          "ci"
        ],
        [
          1,
          "ov"
        ],
        [
          1,
          "vr"
        ],
        [
          1,
          "iu"
        ],
        [
          1,
          "us"
        ],
        [
          1,
          "tm"
        ],
        [
          1,
          "dp"
        ],
        [
          1,
          "ru"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ru"
        ],
        [
          0,
          "dp"
        ],
        [
          0,
          "tm"
        ],
        [
          0,
          "us"
        ],
        [
          0,
          "gh"
        ],
        [
          0,
          "vr"
        ],
        [
          0,
          "ov"
        ],
        [
          0,
          "ci"
        ],
        [
          0,
          "ad"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "wz"
        ],
        [
          1,
          "gj"
        ],
        [
          1,
          "nz"
        ],
        [
          1,
          "qj"
        ],
        [
          1,
          "vt"
        ],
        [
          1,
          "qe"
        ],
        [
          1,
          "qo"
        ],
        [
          1,
          "fc"
        ],
        [
          1,
          "ra"
        ],
        [
          1,
          "st"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "rs"
        ],
        [
          0,
          "rb"
        ],
        [
          0,
          "tn"
        ],
        [
          0,
          "qp"
        ],
        [
          0,
          "qg"
        ],
        [
          0,
          "vv"
        ],
        [
          0,
          "xe"
        ],
        [
          0,
          "ny"
        ],
        [
          0,
          "cf"
        ],
        [
          0,
          "cg"
        ]
      ],
      [
        [
          1,
          "cg"
        ],
        [
          1,
          "cf"
        ],
        [
          1,
          "ny"
        ],
        [
          1,
          "xe"
        ],
        [
          1,
          "vv"
        ],
        [
          1,
          "qg"
        ],
        [
          1,
          "qp"
        ],
        [
          1,
          "tn"
        ],
        [
          1,
          "rb"
        ],
        [
          1,
          "rs"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "st"
        ],
        [
          0,
          "ra"
        ],
        [
          0,
          "fc"
        ],
        [
          0,
          "qo"
        ],
        [
          0,
          "qe"
        ],
        [
          0,
          "vt"
        ],
        [
          0,
          "qj"
        ],
        [
          0,
          "nz"
        ],
        [
          0,
          "gj"
        ],
        [
          0,
          "wz"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          1,
          "ad"
        ],
        [
          1,
          "ci"
        ],
        [
          1,
          "ov"
        ],
        [
          1,
          "vr"
        ],
        [
          1,
          "gh"
        ],
        [
          1,
          "us"
        ],
        [
          1,
          "tm"
        ],
        [
          1,
          "dp"
        ],
        [
          1,
          "ru"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ru"
        ],
        [
          0,
          "dp"
        ],
        [
          0,
          "tm"
        ],
        [
          0,
          "us"
        ],
        [
          0,
          "iu"
        ],
        [
          0,
          "vr"
        ],
        [
          0,
          "ov"
        ],
        [
          0,
          "ci"
        ],
        [
          0,
          "ad"
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "xa"
        ],
        [
          1,
          "wn"
        ],
        [
          1,
          "oa"
        ],
        [
          1,
          "ox"
        ],
        [
          1,
          "vp"
        ],
        [
          1,
          "cp"
        ],
        [
          1,
          "ec"
        ],
        [
          1,
          "im"
        ],
        [
          1,
          "rc"
        ],
        [
          1,
          "sr"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sr"
        ],
        [
          0,
          "rc"
        ],
        [
          0,
          "im"
        ],
        [
          0,
          "ec"
        ],
        [
          0,
          "vf"
        ],
        [
          0,
          "vp"
        ],
        [
          0,
          "ox"
        ],
        [
          0,
          "oa"
        ],
        [
          0,
          "wm"
        ],
        [
          0,
          "wx"
        ]
      ],
      [
        [
          1,
          "ms"
        ],
        [
          1,
          "wo"
        ],
        [
          1,
          "ob"
        ],
        [
          1,
          "oy"
        ],
        [
          1,
          "vn"
        ],
        [
          1,
          "qi"
        ],
        [
          1,
          "eb"
        ],
        [
          1,
          "tj"
        ],
        [
          1,
          "ij"
        ],
        [
          1,
          "rw"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "xf"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "xf"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "rw"
        ],
        [
          0,
          "ij"
        ],
        [
          0,
          "tj"
        ],
        [
          0,
          "eb"
        ],
        [
          0,
          "qi"
        ],
        [
          0,
          "vn"
        ],
        [
          0,
          "oy"
        ],
        [
          0,
          "ob"
        ],
        [
          0,
          "is"
        ],
        [
          0,
          "ms"
        ]
      ],
      [
        [
          1,
          "ct"
        ],
        [
          1,
          "ne"
        ],
        [
          1,
          "ml"
        ],
        [
          1,
          "oz"
        ],
        [
          1,
          "vl"
        ],
        [
          1,
          "qk"
        ],
        [
          1,
          "uu"
        ],
        [
          1,
          "th"
        ],
        [
          1,
          "re"
        ],
        [
          1,
          "ry"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ry"
        ],
        [
          0,
          "re"
        ],
        [
          0,
          "th"
        ],
        [
          0,
          "ur"
        ],
        [
          0,
          "qk"
        ],
        [
          0,
          "vl"
        ],
        [
          0,
          "oz"
        ],
        [
          0,
          "ml"
        ],
        [
          0,
          "ne"
        ],
        [
          0,
          "ct"
        ]
      ],
      [
        [
          1,
          "ww"
        ],
        [
          1,
          "ng"
        ],
        [
          1,
          "wg"
        ],
        [
          1,
          "bl"
        ],
        [
          1,
          "vj"
        ],
        [
          1,
          "ef"
        ],
        [
          1,
          "uw"
        ],
        [
          1,
          "tg"
        ],
        [
          1,
          "dq"
        ],
        [
          1,
          "sp"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sp"
        ],
        [
          0,
          "dq"
        ],
        [
          0,
          "tg"
        ],
        [
          0,
          "uq"
        ],
        [
          0,
          "ef"
        ],
        [
          0,
          "vj"
        ],
        [
          0,
          "bl"
        ],
        [
          0,
          "wg"
        ],
        [
          0,
          "ng"
        ],
        [
          0,
          "ww"
        ]
      ],
      [
        [
          1,
          "ni"
        ],
        [
          1,
          "nh"
        ],
        [
          1,
          "we"
        ],
        [
          1,
          "mi"
        ],
        [
          1,
          "ps"
        ],
        [
          1,
          "ee"
        ],
        [
          1,
          "in"
        ],
        [
          1,
          "iw"
        ],
        [
          1,
          "rg"
        ],
        [
          1,
          "sn"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sn"
        ],
        [
          0,
          "rg"
        ],
        [
          0,
          "iw"
        ],
        [
          0,
          "in"
        ],
        [
          0,
          "ee"
        ],
        [
          0,
          "ps"
        ],
        [
          0,
          "mi"
        ],
        [
          0,
          "we"
        ],
        [
          0,
          "nh"
        ],
        [
          0,
          "mu"
        ]
      ],
      [
        [
          1,
          "mv"
        ],
        [
          1,
          "nj"
        ],
        [
          1,
          "oc"
        ],
        [
          1,
          "mj"
        ],
        [
          1,
          "pu"
        ],
        [
          1,
          "ed"
        ],
        [
          1,
          "io"
        ],
        [
          1,
          "eg"
        ],
        [
          1,
          "ik"
        ],
        [
          1,
          "sa"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "cq"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "cq"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sa"
        ],
        [
          0,
          "ik"
        ],
        [
          0,
          "eg"
        ],
        [
          0,
          "io"
        ],
        [
          0,
          "ed"
        ],
        [
          0,
          "pu"
        ],
        [
          0,
          "mj"
        ],
        [
          0,
          "oc"
        ],
        [
          0,
          "nj"
        ],
        [
          0,
          "mv"
        ]
      ],
      [
        [
          1,
          "wf"
        ],
        [
          1,
          "nl"
        ],
        [
          1,
          "oe"
        ],
        [
          1,
          "pb"
        ],
        [
          1,
          "pv"
        ],
        [
          1,
          "hg"
        ],
        [
          1,
          "ea"
        ],
        [
          1,
          "cn"
        ],
        [
          1,
          "ri"
        ],
        [
          1,
          "an"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "an"
        ],
        [
          0,
          "ri"
        ],
        [
          0,
          "cn"
        ],
        [
          0,
          "ea"
        ],
        [
          0,
          "hg"
        ],
        [
          0,
          "pv"
        ],
        [
          0,
          "pb"
        ],
        [
          0,
          "oe"
        ],
        [
          0,
          "nl"
        ],
        [
          0,
          "wf"
        ]
      ],
      [
        [
          1,
          "mx"
        ],
        [
          1,
          "nm"
        ],
        [
          1,
          "og"
        ],
        [
          1,
          "pd"
        ],
        [
          1,
          "vi"
        ],
        [
          1,
          "ve"
        ],
        [
          1,
          "ul"
        ],
        [
          1,
          "gn"
        ],
        [
          1,
          "hm"
        ],
        [
          1,
          "am"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "am"
        ],
        [
          0,
          "hm"
        ],
        [
          0,
          "gn"
        ],
        [
          0,
          "ul"
        ],
        [
          0,
          "ve"
        ],
        [
          0,
          "vi"
        ],
        [
          0,
          "pd"
        ],
        [
          0,
          "og"
        ],
        [
          0,
          "nm"
        ],
        [
          0,
          "mx"
        ]
      ],
      [
        [
          1,
          "mz"
        ],
        [
          1,
          "nn"
        ],
        [
          1,
          "oi"
        ],
        [
          1,
          "pf"
        ],
        [
          1,
          "px"
        ],
        [
          1,
          "vd"
        ],
        [
          1,
          "dr"
        ],
        [
          1,
          "ei"
        ],
        [
          1,
          "rk"
        ],
        [
          1,
          "sc"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sc"
        ],
        [
          0,
          "rk"
        ],
        [
          0,
          "ei"
        ],
        [
          0,
          "dr"
        ],
        [
          0,
          "vd"
        ],
        [
          0,
          "px"
        ],
        [
          0,
          "pf"
        ],
        [
          0,
          "ok"
        ],
        [
          0,
          "nn"
        ],
        [
          0,
          "mz"
        ]
      ],
      [
        [
          1,
          "wh"
        ],
        [
          1,
          "np"
        ],
        [
          1,
          "om"
        ],
        [
          1,
          "ph"
        ],
        [
          1,
          "py"
        ],
        [
          1,
          "cl"
        ],
        [
          1,
          "uj"
        ],
        [
          1,
          "dt"
        ],
        [
          1,
          "sy"
        ],
        [
          1,
          "se"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "se"
        ],
        [
          0,
          "sy"
        ],
        [
          0,
          "dt"
        ],
        [
          0,
          "uj"
        ],
        [
          0,
          "cl"
        ],
        [
          0,
          "py"
        ],
        [
          0,
          "ph"
        ],
        [
          0,
          "oo"
        ],
        [
          0,
          "np"
        ],
        [
          0,
          "wh"
        ]
      ],
      [
        [
          1,
          "nb"
        ],
        [
          1,
          "nr"
        ],
        [
          1,
          "wc"
        ],
        [
          1,
          "pj"
        ],
        [
          1,
          "qa"
        ],
        [
          1,
          "fh"
        ],
        [
          1,
          "hx"
        ],
        [
          1,
          "dy"
        ],
        [
          1,
          "rm"
        ],
        [
          1,
          "sf"
        ],
        [
          1,
          "aa"
        ],
        [
          1,
          "xf"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "xf"
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sf"
        ],
        [
          0,
          "rm"
        ],
        [
          0,
          "dy"
        ],
        [
          0,
          "hx"
        ],
        [
          0,
          "fh"
        ],
        [
          0,
          "qa"
        ],
        [
          0,
          "pj"
        ],
        [
          0,
          "wc"
        ],
        [
          0,
          "nr"
        ],
        [
          0,
          "nb"
        ]
      ],
      [
        [
          1,
          "wu"
        ],
        [
          1,
          "nt"
        ],
        [
          1,
          "wa"
        ],
        [
          1,
          "pl"
        ],
        [
          1,
          "qb"
        ],
        [
          1,
          "va"
        ],
        [
          1,
          "uh"
        ],
        [
          1,
          "dz"
        ],
        [
          1,
          "ro"
        ],
        [
          1,
          "sh"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sh"
        ],
        [
          0,
          "ro"
        ],
        [
          0,
          "dz"
        ],
        [
          0,
          "uh"
        ],
        [
          0,
          "va"
        ],
        [
          0,
          "qb"
        ],
        [
          0,
          "pl"
        ],
        [
          0,
          "wa"
        ],
        [
          0,
          "nt"
        ],
        [
          0,
          "wu"
        ]
      ],
      [
        [
          1,
          "cv"
        ],
        [
          1,
          "nv"
        ],
        [
          1,
          "oq"
        ],
        [
          1,
          "pn"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "cr"
        ],
        [
          1,
          "ug"
        ],
        [
          1,
          "qw"
        ],
        [
          1,
          "rq"
        ],
        [
          1,
          "cy"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cy"
        ],
        [
          0,
          "rq"
        ],
        [
          0,
          "qw"
        ],
        [
          0,
          "ug"
        ],
        [
          0,
          "cr"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "pn"
        ],
        [
          0,
          "oq"
        ],
        [
          0,
          "nv"
        ],
        [
          0,
          "cv"
        ]
      ],
      [
        [
          1,
          "wr"
        ],
        [
          1,
          "nw"
        ],
        [
          1,
          "or"
        ],
        [
          1,
          "ac"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "ia"
        ],
        [
          1,
          "qq"
        ],
        [
          1,
          "td"
        ],
        [
          1,
          "fi"
        ],
        [
          1,
          "cs"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "cs"
        ],
        [
          0,
          "fi"
        ],
        [
          0,
          "td"
        ],
        [
          0,
          "qq"
        ],
        [
          0,
          "ia"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ac"
        ],
        [
          0,
          "or"
        ],
        [
          0,
          "nw"
        ],
        [
          0,
          "wr"
        ]
      ],
      [
        [
          1,
          "xc"
        ],
        [
          1,
          "wp"
        ],
        [
          1,
          "vy"
        ],
        [
          1,
          "pp"
        ],
        [
          1,
          "vg"
        ],
        [
          1,
          "cu"
        ],
        [
          1,
          "qs"
        ],
        [
          1,
          "ue"
        ],
        [
          1,
          "fj"
        ],
        [
          1,
          "sj"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sj"
        ],
        [
          0,
          "fj"
        ],
        [
          0,
          "tb"
        ],
        [
          0,
          "qs"
        ],
        [
          0,
          "cu"
        ],
        [
          0,
          "vg"
        ],
        [
          0,
          "pp"
        ],
        [
          0,
          "vy"
        ],
        [
          0,
          "wj"
        ],
        [
          0,
          "mq"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          1,
          "cm"
        ],
        [
          1,
          "ot"
        ],
        [
          1,
          "pq"
        ],
        [
          1,
          "qc"
        ],
        [
          1,
          "qm"
        ],
        [
          1,
          "qu"
        ],
        [
          1,
          "qy"
        ],
        [
          1,
          "fb"
        ],
        [
          1,
          "sv"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "sk"
        ],
        [
          0,
          "fb"
        ],
        [
          0,
          "qy"
        ],
        [
          0,
          "qu"
        ],
        [
          0,
          "qm"
        ],
        [
          0,
          "qc"
        ],
        [
          0,
          "pq"
        ],
        [
          0,
          "ot"
        ],
        [
          0,
          "cm"
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "am",
    "an",
    "bl",
    "cf",
    "cg",
    "ci",
    "cl",
    "cm",
    "cn",
    "cp",
    "cq",
    "cr",
    "cs",
    "ct",
    "cu",
    "cv",
    "cw",
    "cy",
    "dd",
    "de",
    "df",
    "dg",
    "dh",
    "dj",
    "dl",
    "dm",
    "do",
    "dp",
    "dq",
    "dr",
    "dt",
    "dy",
    "dz",
    "ea",
    "eb",
    "ec",
    "ed",
    "ee",
    "ef",
    "eg",
    "ei",
    "ej",
    "eo",
    "er",
    "es",
    "et",
    "ex",
    "fb",
    "fc",
    "fh",
    "fi",
    "fj",
    "gh",
    "gj",
    "gn",
    "hg",
    "hm",
    "hx",
    "ia",
    "ib",
    "ie",
    "ij",
    "ik",
    "im",
    "in",
    "io",
    "is",
    "iu",
    "iw",
    "iz",
    "jt",
    "ju",
    "jv",
    "jx",
    "kq",
    "kw",
    "ky",
    "mi",
    "mj",
    "ml",
    "mq",
    "ms",
    "mt",
    "mu",
    "mv",
    "mw",
    "mx",
    "my",
    "mz",
    "na",
    "nb",
    "nc",
    "nd",
    "ne",
    "nf",
    "ng",
    "nh",
    "ni",
    "nj",
    "nk",
    "nl",
    "nm",
    "nn",
    "no",
    "np",
    "nq",
    "nr",
    "ns",
    "nt",
    "nu",
    "nv",
    "nw",
    "nx",
    "ny",
    "nz",
    "oa",
    "ob",
    "oc",
    "od",
    "oe",
    "of",
    "og",
    "oh",
    "oi",
    "oj",
    "ok",
    "ol",
    "om",
    "on",
    "oo",
    "op",
    "oq",
    "or",
    "os",
    "ot",
    "ou",
    "ov",
    "ow",
    "ox",
    "oy",
    "oz",
    "pa",
    "pb",
    "pc",
    "pd",
    "pe",
    "pf",
    "pg",
    "ph",
    "pi",
    "pj",
    "pk",
    "pl",
    "pm",
    "pn",
    "po",
    "pp",
    "pq",
    "pr",
    "ps",
    "pt",
    "pu",
    "pv",
    "pw",
    "px",
    "py",
    "pz",
    "qa",
    "qb",
    "qc",
    "qd",
    "qe",
    "qf",
    "qg",
    "qh",
    "qi",
    "qj",
    "qk",
    "ql",
    "qm",
    "qn",
    "qo",
    "qp",
    "qq",
    "qr",
    "qs",
    "qt",
    "qu",
    "qv",
    "qw",
    "qx",
    "qy",
    "qz",
    "ra",
    "rb",
    "rc",
    "rd",
    "re",
    "rf",
    "rg",
    "rh",
    "ri",
    "rj",
    "rk",
    "rl",
    "rm",
    "rn",
    "ro",
    "rp",
    "rq",
    "rr",
    "rs",
    "rt",
    "ru",
    "rv",
    "rw",
    "rx",
    "ry",
    "rz",
    "sa",
    "sb",
    "sc",
    "sd",
    "se",
    "sf",
    "sg",
    "sh",
    "si",
    "sj",
    "sk",
    "sl",
    "sm",
    "sn",
    "so",
    "sp",
    "sq",
    "sr",
    "ss",
    "st",
    "su",
    "sv",
    "sw",
    "sx",
    "sy",
    "sz",
    "ta",
    "tb",
    "tc",
    "td",
    "te",
    "tf",
    "tg",
    "th",
    "ti",
    "tj",
    "tk",
    "tl",
    "tm",
    "tn",
    "uc",
    "ue",
    "uf",
    "ug",
    "uh",
    "ui",
    "uj",
    "uk",
    "ul",
    "um",
    "un",
    "uo",
    "up",
    "uq",
    "ur",
    "us",
    "ut",
    "uu",
    "uv",
    "uw",
    "ux",
    "uy",
    "uz",
    "va",
    "vb",
    "vc",
    "vd",
    "ve",
    "vf",
    "vg",
    "vh",
    "vi",
    "vj",
    "vk",
    "vl",
    "vm",
    "vn",
    "vp",
    "vq",
    "vr",
    "vs",
    "vt",
    "vu",
    "vv",
    "vw",
    "vx",
    "vy",
    "vz",
    "wa",
    "wb",
    "wc",
    "wd",
    "we",
    "wf",
    "wg",
    "wh",
    "wj",
    "wk",
    "wl",
    "wm",
    "wn",
    "wo",
    "wp",
    "wq",
    "wr",
    "ws",
    "wt",
    "wu",
    "wv",
    "ww",
    "wx",
    "wy",
    "wz",
    "xa",
    "xb",
    "xc",
    "xd",
    "xe",
    "xf",
    "xg",
    "xh"
  ],
  "name": "大局将棋",
  "nari": {
    "aa": "do",
    "ab": "vx",
    "ac": "ky",
    "ad": "de",
    "ae": "dd",
    "af": "dl",
    "ag": "dm",
    "am": "pz",
    "an": "nd",
    "bl": "ie",
    "cf": "uc",
    "cg": "wz",
    "ci": "df",
    "cl": "dg",
    "cm": "vw",
    "cn": "cw",
    "cp": "uv",
    "cq": "xh",
    "cr": "pc",
    "cs": "qr",
    "ct": "qj",
    "cu": "ux",
    "cv": "wt",
    "cy": "sm",
    "dp": "rj",
    "dq": "rj",
    "dr": "uk",
    "dt": "dl",
    "dy": "eo",
    "dz": "te",
    "ea": "un",
    "eb": "er",
    "ec": "es",
    "ed": "et",
    "ee": "ej",
    "ef": "eo",
    "eg": "sz",
    "ei": "ex",
    "fb": "sx",
    "fc": null,
    "fh": "vc",
    "fi": "kq",
    "fj": "kw",
    "gh": null,
    "gj": "pe",
    "gn": "cw",
    "hg": "gh",
    "hm": "ta",
    "hx": "ui",
    "ia": "uy",
    "ib": "uz",
    "ij": "rj",
    "ik": "rj",
    "im": "tl",
    "in": "up",
    "io": "uo",
    "is": "wl",
    "iu": "gh",
    "iw": "tf",
    "mi": "vx",
    "mj": "vw",
    "ml": "wh",
    "mq": "wq",
    "ms": "mt",
    "mu": null,
    "mv": "mw",
    "mx": "my",
    "mz": "na",
    "nb": "nd",
    "nc": "nd",
    "ne": "nf",
    "ng": "jt",
    "nh": "ni",
    "ni": null,
    "nj": "nk",
    "nl": "jv",
    "nm": "ju",
    "nn": "no",
    "np": "nq",
    "nr": "ns",
    "nt": "nu",
    "nv": "dd",
    "nw": "nx",
    "ny": null,
    "nz": null,
    "oa": "nz",
    "ob": "ny",
    "oc": "od",
    "oe": "of",
    "og": "oh",
    "oi": "oj",
    "ok": "ol",
    "om": "on",
    "oo": "op",
    "oq": "jx",
    "or": "os",
    "ot": "ou",
    "ov": "ow",
    "ox": "ns",
    "oy": "os",
    "oz": "pa",
    "pb": "pc",
    "pd": "pe",
    "pf": "pg",
    "ph": "pi",
    "pj": "pk",
    "pl": "pm",
    "pn": "po",
    "pp": "nf",
    "pq": "pr",
    "ps": "pt",
    "pu": "ns",
    "pv": "pw",
    "px": "jt",
    "py": "pz",
    "qa": "dd",
    "qb": "jx",
    "qc": "qd",
    "qe": "qf",
    "qg": "qh",
    "qi": "qj",
    "qj": null,
    "qk": "ql",
    "qm": "qn",
    "qo": null,
    "qp": null,
    "qq": "qr",
    "qs": "qt",
    "qu": "qv",
    "qw": "qx",
    "qy": "qz",
    "ra": null,
    "rb": null,
    "rc": "rd",
    "re": "rf",
    "rg": "rh",
    "ri": "rj",
    "rk": "rl",
    "rm": "rn",
    "ro": "rp",
    "rq": "rr",
    "rs": "rt",
    "ru": "rv",
    "rw": "rx",
    "ry": "rz",
    "sa": "sb",
    "sc": "sd",
    "se": "dl",
    "sf": "sg",
    "sh": "si",
    "sj": "ky",
    "sk": "sl",
    "sn": "so",
    "sp": "sq",
    "sr": "ss",
    "st": "su",
    "sv": "sw",
    "sy": "rb",
    "tb": "tc",
    "td": "mu",
    "tg": "cw",
    "th": "ti",
    "tj": "tk",
    "tm": "ns",
    "tn": null,
    "ue": "uf",
    "ug": "mu",
    "uh": "dj",
    "uj": "pc",
    "ul": "um",
    "uq": "rt",
    "ur": "dh",
    "us": "ut",
    "uu": "uv",
    "uw": "ni",
    "va": "vb",
    "vd": "nd",
    "ve": "dm",
    "vf": "uv",
    "vg": "vh",
    "vi": "qx",
    "vj": "vk",
    "vl": "vm",
    "vn": "qr",
    "vp": "vq",
    "vr": "vs",
    "vt": "vu",
    "vv": "iz",
    "vy": "vz",
    "wa": "wb",
    "wc": "wd",
    "we": "wf",
    "wf": "dj",
    "wg": "wh",
    "wh": null,
    "wj": "wk",
    "wm": "wl",
    "wn": "wl",
    "wo": "wl",
    "wp": "wk",
    "wr": "ws",
    "wu": "wv",
    "ww": "dj",
    "wx": "wy",
    "wz": null,
    "xa": "xb",
    "xc": "xd",
    "xe": "qj",
    "xf": "xg"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000025")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000039")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00003f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000040")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000041")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000043")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000044")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000045")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000046")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000047")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000048")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000049")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00004c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000051")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000052")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000053")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000054")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000055")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000057")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000059")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00005f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000061")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000066")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000067")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000068")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000069")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00006a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00006b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00006c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00006d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00006e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000070")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000071")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000076")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000079")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00007a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00007b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00007f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000083")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000084")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e000089")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00008a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e00008b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a5")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000a9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000bc")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000c2")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000cd")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000d9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000da")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000dc")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000dd")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000de")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e2")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48cbb94325a2633e0000e9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000013")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000014")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000015")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000017")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900002a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000030")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000032")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000056")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000057")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000059")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900005e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000060")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000061")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000062")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000063")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000064")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000065")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000066")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000067")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000068")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000069")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900006a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900006b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900006c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900006d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900006e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900006f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000070")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000071")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000072")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000073")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000074")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000075")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000076")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000077")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000078")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000079")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900007a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900007b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900007c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900007d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900007e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900007f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000080")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000081")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000082")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000083")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000084")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000085")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000086")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000087")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000088")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000089")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900008a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900008b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900008c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900008d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900008e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900008f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000090")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000091")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000092")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000093")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000094")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000095")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000096")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000097")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000098")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000099")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900009a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900009b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900009c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900009d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900009e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a2114900009f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000a0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000a1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000a2")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000a3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000a4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000a5")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000a6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000a7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000a8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000a9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000aa")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000ab")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000ac")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000ad")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000ae")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000af")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000b0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000b1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000b2")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000b3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000b4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000b5")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000b6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000b7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000b8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000b9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000ba")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000bb")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000bc")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000bd")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000be")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000bf")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000c0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000c1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000c2")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000c3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000c4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000c5")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000c6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000c7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000c8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000c9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000ca")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000cb")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000cc")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a211490000cd")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000ce")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000cf")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000d0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000d1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000d2")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000d3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000d4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000d5")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000d6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000d7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000d8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000d9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000da")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000db")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000dc")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000dd")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000de")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000df")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000e0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000e1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000e2")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000e3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000e4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000e5")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000e6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000e7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000e8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000e9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000ea")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000eb")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000ec")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000ed")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000ee")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000ef")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000f0")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000f1")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000f2")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000f3")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000f4")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000f5")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000f6")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000f7")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000f8")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000f9")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000fa")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000fb")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000fc")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000fd")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000fe")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a211490000ff")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000100")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000101")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000102")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000103")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000104")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000105")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000106")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000107")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000108")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000109")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900010a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900010b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900010c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900010d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900010e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900010f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000110")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000111")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000120")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000122")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000123")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000124")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000125")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000126")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000127")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000128")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000129")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900012a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900012b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900012c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900012d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900012e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900012f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000130")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000131")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000132")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000133")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000134")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000135")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000136")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000137")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000138")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000139")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900013a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900013b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900013c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900013d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900013e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900013f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000140")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000141")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000142")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000143")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000144")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000145")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000147")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000148")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000149")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900014a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900014b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900014c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900014d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900014e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900014f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000150")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000151")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000152")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000153")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000154")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000155")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000156")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000157")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000158")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000159")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900015b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900015c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900015d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900015e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900015f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000160")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000161")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000162")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000163")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000164")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000165")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000166")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000167")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000168")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000169")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900016a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900016b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900016c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900016d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900016e")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900016f")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000170")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000171")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000172")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000173")
    }
  ],
  "size": [
    36,
    36
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "NoUse": true
    },
    "Promotion": {
      "Normal": {
        "must": true,
        "dan": 11
      }
    }
  },
  "winkoma": [
    "wz",
    "cg",
    "uc"
  ]
});
db.getCollection("rule").insert({
  "_id": 73,
  "abstract": "敵味方の駒が目の前に向かい合ったとき、互いの駒が入れ替わる。向きは対面を保ったまま、駒の中間を中心に１８０度回転する。また、自分や相手が二歩になるような着手はできない。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "どんでん返し",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MoveEffect": {
      "Donden": true
    },
    "Nifu": {
      "Whole": true
    },
    "Promotion": {
      "Normal": {
        "illegal": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 75,
  "abstract": "３手ずつ指す。ただし、３手とも別の駒でなくてはならない。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "バレーボール",
  "players": [
    0,
    0,
    0,
    1,
    1,
    1
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MoveControl": {
      "Volleyball": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 76,
  "abstract": "チェス。アンパッサン、キャスリング未実装",
  "incomplete": true,
  "img": {
    "height": 48,
    "width": 48
  },
  "init": {
    "ban": [
      [
        [
          1,
          "vo"
        ],
        [
          1,
          "ki"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ki"
        ],
        [
          0,
          "vo"
        ]
      ],
      [
        [
          1,
          "kk"
        ],
        [
          1,
          "ki"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ki"
        ],
        [
          0,
          "kk"
        ]
      ],
      [
        [
          1,
          "ud"
        ],
        [
          1,
          "ki"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ki"
        ],
        [
          0,
          "ud"
        ]
      ],
      [
        [
          1,
          "yl"
        ],
        [
          1,
          "ki"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ki"
        ],
        [
          0,
          "yl"
        ]
      ],
      [
        [
          1,
          "yk"
        ],
        [
          1,
          "ki"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ki"
        ],
        [
          0,
          "yk"
        ]
      ],
      [
        [
          1,
          "ud"
        ],
        [
          1,
          "ki"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ki"
        ],
        [
          0,
          "ud"
        ]
      ],
      [
        [
          1,
          "kk"
        ],
        [
          1,
          "ki"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ki"
        ],
        [
          0,
          "kk"
        ]
      ],
      [
        [
          1,
          "vo"
        ],
        [
          1,
          "ki"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ki"
        ],
        [
          0,
          "vo"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "ki",
    "kk",
    "ud",
    "vo",
    "yk",
    "yl"
  ],
  "name": "チェス",
  "nari": {
    "ki": "yk",
    "kk": null,
    "ud": null,
    "vo": null,
    "yk": null,
    "yl": null
  },
  "noRoom": true,
  "noreverse": "koma",
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000022")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3214325a21149000024")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000121")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000146")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000190")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000191")
    }
  ],
  "size": [
    8,
    8
  ],
  "strategy": {
    "MochigomaIO": {
      "NoUse": true
    },
    "Promotion": {
      "Normal": {
        "dan": 1
      }
    }
  },
  "winkoma": [
    "yl"
  ]
});
db.getCollection("rule").insert({
  "_id": 77,
  "abstract": "盤面の端とつながっていない駒は盤上から消える。駒が縦横に連なっていて端とつながっていればよい。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "水中将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MoveEffect": {
      "Underwater": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 79,
  "abstract": "狭い。",
  "init": {
    "ban": [
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ac"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai",
    "aj",
    "ak",
    "al",
    "am",
    "an"
  ],
  "name": "狭い将棋",
  "nari": {
    "aa": "ai",
    "ab": "aj",
    "ac": "ak",
    "ad": "al",
    "ae": null,
    "af": "am",
    "ag": "an",
    "ah": null
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    }
  ],
  "size": [
    9,
    7
  ],
  "strategy": null,
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 80,
  incomplete: true,
  "abstract": "普通のオセロです。",
  "img": {
    "height": 48,
    "width": 48
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yo"
        ],
        [
          1,
          "yo"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          1,
          "yo"
        ],
        [
          0,
          "yo"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "オセロ",
  "nari": [
    
  ],
  "noreverse": "koma",
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e490b014325a21249000059")
    }
  ],
  "size": [
    8,
    8
  ],
  "strategy": {
    "Judge": {
      "Othello": true
    },
    "MochigomaIO": {
      "Infinity": {
        "autoput": true
      }
    },
    "MoveEffect": {
      "Othello": {
        "must": true
      }
    },
    "TebanRotation": {
      "Othello": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 81,
  incomplete: true,
  "abstract": "普通の五目並べです。三三(「３個連続」または「１つ空きで３つが並んでいる」、かつ「両端が空いている」という状態が２方向に発生した場合)は禁止です。",
  "css": "igo",
  "img": {
    "height": 30,
    "width": 30
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "五目並べ",
  "nari": [
    
  ],
  "noreverse": "ban",
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e490b014325a21249000059")
    }
  ],
  "size": [
    19,
    19
  ],
  "strategy": {
    "Judge": {
      "Gomoku": {
        "moku": 5,
        "sansan": true
      }
    },
    "MochigomaIO": {
      "Infinity": {
        "autoput": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 82,
  incomplete: true,
  "abstract": "下方向へ落ちる四目並べです。",
  "img": {
    "height": 48,
    "width": 48
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "重力四目並べ",
  "nari": [
    
  ],
  "noreverse": "ban",
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e490b014325a21249000059")
    }
  ],
  "size": [
    7,
    6
  ],
  "strategy": {
    "Destination": {
      "Gravity": true
    },
    "Judge": {
      "Gomoku": {
        "moku": 4
      }
    },
    "MochigomaIO": {
      "Infinity": {
        "autoput": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 83,
  incomplete: true,
  "abstract": "最初の黒以外は２手ずつ打つ六目並べ。",
  "css": "igo",
  "img": {
    "height": 30,
    "width": 30
  },
  "init": {
    "ban": [
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "name": "六目並べ",
  "nari": [
    
  ],
  "noreverse": "ban",
  "players": [
    0,
    1,
    1,
    0
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e490b014325a21249000059")
    }
  ],
  "size": [
    19,
    19
  ],
  "strategy": {
    "Judge": {
      "Gomoku": {
        "moku": 6
      }
    },
    "MochigomaIO": {
      "Infinity": {
        "autoput": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 86,
  "abstract": "味方の駒が横に複数並んだとき、左からn番目の駒の性能が右からn番目の駒の性能になる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "横ネコ鮮将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "KomaSuggest": {
      "Yokonekosen": true
    },
    "Promotion": {
      "Normal": {
        "illegal": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 87,
  "abstract": "敵味方関わらず駒が横に複数並んだとき、左からn番目の駒の性能が右からn番目の駒の性能になる。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "横ネコネコ鮮将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "KomaSuggest": {
      "Yokonekonekosen": true
    },
    "Promotion": {
      "Normal": {
        "illegal": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 90,
  "abstract": "せっまい。",
  "init": {
    "ban": [
      [
        [
          1,
          "ac"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ab"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          1,
          "af"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "ag"
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ah"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ah"
        ]
      ],
      [
        [
          1,
          "ae"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ae"
        ]
      ],
      [
        [
          1,
          "ad"
        ],
        [
          1,
          "ag"
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          0,
          "af"
        ],
        [
          0,
          "ad"
        ]
      ],
      [
        [
          1,
          "ab"
        ],
        [
          
        ],
        [
          1,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "aa"
        ],
        [
          
        ],
        [
          0,
          "ac"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "aa",
    "ab",
    "ac",
    "ad",
    "ae",
    "af",
    "ag",
    "ah",
    "ai",
    "aj",
    "ak",
    "al",
    "am",
    "an"
  ],
  "name": "せっまい将棋",
  "nari": {
    "aa": "ai",
    "ab": "aj",
    "ac": "ak",
    "ad": "al",
    "ae": null,
    "af": "am",
    "ag": "an",
    "ah": null
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000000")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000001")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000002")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000003")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000004")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000005")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000006")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000007")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000008")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f000009")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48b9cf4325a2053f00000d")
    }
  ],
  "size": [
    7,
    7
  ],
  "strategy": null,
  "winkoma": [
    "ah"
  ]
});
db.getCollection("rule").insert({
  "_id": 93,
  "abstract": "駒を取ると、駒台にその駒が２つ乗る。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "増殖将棋",
  "strategy": {
    "MochigomaIO": {
      "Double": true
    }
  }
});
db.getCollection("rule").insert({
  "_id": 100,
  "abstract": "北尾女流の案。原図: http:\/\/p.twipple.jp\/RAzTY 2〜4筋の手前2段目は宮であり、仕と師はそこから出られない。3段目と4段目の間には河があり、相は越えられず、兵は越えると成る。",
  "init": {
    "ban": [
      [
        [
          1,
          "yu"
        ],
        [
          1,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yx"
        ],
        [
          0,
          "yv"
        ]
      ],
      [
        [
          1,
          "yt"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "ys"
        ]
      ],
      [
        [
          1,
          "yr"
        ],
        [
          1,
          "yw"
        ],
        [
          1,
          "yx"
        ],
        [
          0,
          "yx"
        ],
        [
          0,
          "yw"
        ],
        [
          0,
          "yr"
        ]
      ],
      [
        [
          1,
          "ys"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yt"
        ]
      ],
      [
        [
          1,
          "yv"
        ],
        [
          1,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yx"
        ],
        [
          0,
          "yu"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "yr",
    "ys",
    "yt",
    "yu",
    "yv",
    "yw",
    "yx",
    "yy"
  ],
  "name": "ミニシャンチー1(仮)",
  "nari": {
    "yr": null,
    "ys": null,
    "yt": null,
    "yu": null,
    "yv": null,
    "yw": null,
    "yx": "yy"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000197")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000198")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000199")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019b")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019e")
    }
  ],
  "size": [
    5,
    6
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "NoUse": true
    },
    "MoveControl": {
      "NoTaimen": {
        "species": [
          "yr"
        ]
      }
    },
    "MoveFilter": {
      "Restricted": {
        "place": [
          {
            "species": [
              "yr",
              "ys"
            ],
            "min": {
              "x": 2,
              "y": 5
            },
            "max": {
              "x": 4,
              "y": 6
            }
          },
          {
            "species": [
              "yu"
            ],
            "min": {
              "x": 1,
              "y": 4
            },
            "max": {
              "x": 5,
              "y": 6
            }
          }
        ]
      }
    },
    "Promotion": {
      "Normal": {
        "must": true
      }
    }
  },
  "winkoma": [
    "yr"
  ]
});
db.getCollection("rule").insert({
  "_id": 102,
  "abstract": "@yon_ichiroさんの案2つ目。原図: http:\/\/twitpic.com\/5hpm2f 2〜4筋の手前3段目は宮であり、仕と師はそこから出られない。3段目と4段目の間には河があり、相は越えられず、兵は越えると成る。",
  "init": {
    "ban": [
      [
        [
          1,
          "yt"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yw"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yx"
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          1,
          "yr"
        ],
        [
          1,
          "ys"
        ],
        [
          1,
          "yu"
        ],
        [
          0,
          "yu"
        ],
        [
          0,
          "ys"
        ],
        [
          0,
          "yr"
        ]
      ],
      [
        [
          
        ],
        [
          
        ],
        [
          1,
          "yx"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ]
      ],
      [
        [
          1,
          "yw"
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          
        ],
        [
          0,
          "yt"
        ]
      ]
    ],
    "mochigoma": [
      [
        
      ],
      [
        
      ]
    ]
  },
  "koma": [
    "yr",
    "ys",
    "yt",
    "yu",
    "yw",
    "yx",
    "yy"
  ],
  "name": "ミニシャンチー3(仮)",
  "nari": {
    "yr": null,
    "ys": null,
    "yt": null,
    "yu": null,
    "yw": null,
    "yx": "yy"
  },
  "players": [
    0,
    1
  ],
  "refKoma": [
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000197")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000198")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a21149000199")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019a")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019c")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019d")
    },
    {
      "$ref": "koma",
      "$id": ObjectId("4e48d3224325a2114900019e")
    }
  ],
  "size": [
    5,
    6
  ],
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "MochigomaIO": {
      "NoUse": true
    },
    "MoveControl": {
      "NoTaimen": {
        "species": [
          "yr"
        ]
      }
    },
    "MoveFilter": {
      "Restricted": {
        "place": [
          {
            "species": [
              "yr",
              "ys"
            ],
            "min": {
              "x": 2,
              "y": 4
            },
            "max": {
              "x": 4,
              "y": 6
            }
          },
          {
            "species": [
              "yu"
            ],
            "min": {
              "x": 1,
              "y": 4
            },
            "max": {
              "x": 5,
              "y": 6
            }
          }
        ]
      }
    },
    "Promotion": {
      "Normal": {
        "must": true
      }
    }
  },
  "winkoma": [
    "yr"
  ]
});
db.getCollection("rule").insert({
  "_id": 24,
  "abstract": "味方の駒も取って持ち駒にできる。",
  "eatfriend": true,
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "仲間割れ将棋",
  "strategy": {
    "CaptureControl": {
      "Nakamaware": true
    },
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    }
  }
});
db.getCollection("rule").insert({
  "_id": 107,
  "abstract": "持った駒が、移動可能範囲の中からランダムに選ばれたマスに移動する。持ち駒の打ち場所もランダム。",
  "extend": {
    "$ref": "rule",
    "$id": 0
  },
  "name": "ランダム将棋",
  "strategy": {
    "Judge": {
      "Oute": {
        "ignore": true
      },
      "Tsumi": {
        "ignore": true
      }
    },
    "Destination": {
      "Random": [
        
      ]
    }
  }
});
